Autodesk.DesignScript.Geometry.Cuboid.Length
Returns length distance.
Note: This return the input dimensions of the Cuboid, NOT the
actual world space dimensions. In other words, if you create a Cuboid
width (X-axis) length 10, and transform it to a CoordinateSystem with
2 times scaling in X, the width will still be 10. ASM does not allow you
to extract the Vertices of a body in any predictable order, so it
impossible to determine the dimensions after a transform.

Autodesk.DesignScript.Geometry.Cuboid.Width
Returns width distance.
Note: This return the input dimensions of the Cuboid, NOT the
actual world space dimensions. In other words, if you create a Cuboid
width (X-axis) length 10, and transform it to a CoordinateSystem with
2 times scaling in X, the width will still be 10. ASM does not allow you
to extract the Vertices of a body in any predictable order, so it
impossible to determine the dimensions after a transform.

Autodesk.DesignScript.Geometry.Cuboid.Height
Returns height distance.
Note: This return the input dimensions of the Cuboid, NOT the
actual world space dimensions. In other words, if you create a Cuboid
width (X-axis) length 10, and transform it to a CoordinateSystem with
2 times scaling in X, the width will still be 10. ASM does not allow you
to extract the Vertices of a body in any predictable order, so it
impossible to determine the dimensions after a transform.

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(System.Double,System.Double,System.Double)
Create a Cuboid centered at WCS origin, with width, length, and height.
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double)
Create a Cuboid centered at input Point, with specified width, length,
and height.
origin: Origin point
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created by lengths
box,cube,cubebysize,bycenter,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Create a Cuboid centered at WCS origin, with width, length, and height.
coordinateSystem: Parent coordinate system (center of cuboid)
width: Width of cuboid
length: Length of cuboid
height: Height of cuboid
Returns: Cuboid created from lengths
box,cube,cubebysize,bycoord,cubes

Autodesk.DesignScript.Geometry.Cuboid.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create an Cuboid spanning from low Point to high Point.
lowPoint: Corner low point of cuboid
highPoint: Corner high point of cuboid
Returns: Cuboind created by corners
box,cube,byminmax,by corners,by points,cubes

Autodesk.DesignScript.Geometry.Cuboid.ToString
Get a string representation of the Cuboid