Autodesk.DesignScript.Geometry.BoundingBox.FromJson(System.String)
Parse the incoming JSON string formatted with autodesk.geometry:boundingbox3d-1.0.0 schema.
json: JSON string to parse
Returns: BoundingBox

Autodesk.DesignScript.Geometry.BoundingBox.ToJson
Convert the BoundingBox into a JSON object formatted with autodesk.geometry:boundingbox3d-1.0.0 schema.
Returns: The resulting JSON string

Autodesk.DesignScript.Geometry.BoundingBox.MinPoint
The minimum point

Autodesk.DesignScript.Geometry.BoundingBox.MaxPoint
The maximum point

Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
The CoordinateSystem of the BoundingBox.
For an axis-aligned box, the CS is oriented along with the X, Y, Z axes and is located at the center of the box.
For a non-aligned box, the CS can have an arbitrary orientation and is centered at the center of the box.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Get the intersection of two BoundingBoxes.
Note: This does not work for non-axis-aligned boxes as those intersections might not result in a box. Intersect their corresponding cuboids instead.
other: Other bounding box to intersect
Returns: Bounding box obtained from intersection of bounding boxes

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determine whether two BoundingBoxes intersect.
Note: This works only if both bounding boxes have the same alignment (transform). In such cases, test the intersection between their corresponding cuboids.
other: Other bounding box
Returns: Do bounding boxes intersect
get overlap

Autodesk.DesignScript.Geometry.BoundingBox.IsEmpty
Determine if the BoundingBox is empty
Returns: Returns true if the bounding box is empty

Autodesk.DesignScript.Geometry.BoundingBox.Contains(Autodesk.DesignScript.Geometry.Point)
Determine if a point is inside of the bounding box.
point: The test point
Returns: True if the point is inside, otherwise False
point inside,testpoint

Autodesk.DesignScript.Geometry.BoundingBox.ToCuboid
Get the bounding box as a solid cuboid.
Returns: Returns cuboid representation of the bounding box.
converttosolid,bb2cube,bb2cub,bounding tosolid,cubes
0.5,0.4,0.3,0.5,0.3

Autodesk.DesignScript.Geometry.BoundingBox.ToPolySurface
Get the BoundingBox as a collection of Surfaces.
Returns:  Returns polysurface representation of the bounding box
converttosurfaces,convert2surfaces,bbtosrfs,bbtosrfs,bounding to surfaces,bound to poly,convert2poly

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometry(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Create an axis-aligned BoundingBox around input Geometries.
geom: Geometries to determine bounding box
Returns: Bounding box enclosing geometries
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByMinimumVolume(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Create a non-axis-aligned, minimum-volume, oriented bounding box around the input geometries.
geom:
Returns: Oriented bounding box arounding input geometries.

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.CoordinateSystem)
Create a non-axis-aligned BoundingBox around input Geometry, oriented
in the X, Y, and Z axis of the CoordinateSystem.
bounding,bound

Autodesk.DesignScript.Geometry.BoundingBox.ByGeometryCoordinateSystem(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},Autodesk.DesignScript.Geometry.CoordinateSystem)
Create a non-axis-aligned BoundingBox around input Geometries, oriented
in the X, Y, and Z axis of the CoordinateSystem.
bounding,bound,multiple,boundall

Autodesk.DesignScript.Geometry.BoundingBox.ByCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Creates the an axis-aligned BoundingBox spanning between the minimum Point and the maximum Point.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.ByCornersCoordinateSystem(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.CoordinateSystem)
Constructs a BoundingBox from minimum coordinates (lower-left-rear corner of the box),
to maximum coordinates (upper-right-front corner of the box). CoordinateSystem
is the transform FROM the coordinate space of the box TO the model space.
This method is designed to match Revit's API, allowing you to extract out the parameters
from a Revit BoundingBox without any conversions.
bounding,bound,bymaxmin,max,min,bypoints

Autodesk.DesignScript.Geometry.BoundingBox.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compare two BoundingBox's
other: The other BoundingBox
Returns: Whether the two objects are equal

Autodesk.DesignScript.Geometry.BoundingBox.ComputeHashCode
Get a hashcode for this type
Returns:  A unique hashcode for this object

Autodesk.DesignScript.Geometry.BoundingBox.ToString
Get a string representation of the BoundingBox