Autodesk.DesignScript.Geometry.Polygon.Corners
Returns corners of polygon

Autodesk.DesignScript.Geometry.Polygon.Center
Returns average point of corners of polygon
centroid

Autodesk.DesignScript.Geometry.Polygon.Points
Returns all the segment start / end points.

Autodesk.DesignScript.Geometry.Polygon.PlaneDeviation
Returns maximum deviation from average plane of polygon.

Autodesk.DesignScript.Geometry.Polygon.SelfIntersections
Returns self intersections between sides of the polygon.

Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Returns whether an input point is contained within the polygon.
If the polygon is not planar then the point will be projected onto the
best-fit plane and the containment will be computed using the projection
of the polygon onto the best-fit plane.
This will return a failed status if the polygon self-intersects.

Autodesk.DesignScript.Geometry.Polygon.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Construct a Polygon Curve by connecting Points.

Autodesk.DesignScript.Geometry.Polygon.RegularPolygon(Autodesk.DesignScript.Geometry.Circle,System.Int32)
Construct an inscribed Polygon Curve within a circle.

Autodesk.DesignScript.Geometry.Polygon.ToString
Get a string representation of the Polygon