Autodesk.DesignScript.Geometry.Vertex.PointGeometry
The Point where this Vertex is located
Returns:

Autodesk.DesignScript.Geometry.Vertex.AdjacentEdges
The Edges emanating from this Vertex
Returns:

Autodesk.DesignScript.Geometry.Vertex.AdjacentFaces
The Faces adjacent to this Vertex
Returns:

Autodesk.DesignScript.Geometry.Vertex.ToString
Get a string representation of the Vertex