Autodesk.DesignScript.Geometry.UV.U
Get the U component of a UV
uv,uvs

Autodesk.DesignScript.Geometry.UV.V
Get the V component of a V
uv,uvs

Autodesk.DesignScript.Geometry.UV.ByCoordinates(System.Double,System.Double)
Create a UV from two doubles.
u: U value
v: V value
Returns: UV created by coordinates
surfaceparam,parameters,uv,uvs

Autodesk.DesignScript.Geometry.UV.Equals(System.Object)
Compare two UV's
other: The other UV
Returns: Whether the two objects are equal

Autodesk.DesignScript.Geometry.UV.GetHashCode
Get a hashcode for this type
Returns:  A unique hashcode for this object

Autodesk.DesignScript.Geometry.UV.ToString
Get a string representation of the UV