Autodesk.DesignScript.Geometry.TSpline.TSplineUVNFrame.Position
Point of the TopologyItem on the hull

Autodesk.DesignScript.Geometry.TSpline.TSplineUVNFrame.U
U vector of the TopologyItem

Autodesk.DesignScript.Geometry.TSpline.TSplineUVNFrame.V
V vector of the TopologyItem

Autodesk.DesignScript.Geometry.TSpline.TSplineUVNFrame.Normal
Normal of the TopologyItem

Autodesk.DesignScript.Geometry.TSpline.TSplineUVNFrame.ToString
Get a string representation of the TSplineUVNFrame