Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.IsRadial
Whether the reflection is radial

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.SegmentsCount
Number of segments of radial reflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.SegmentAngle
Angle between each pair of symmetric segments of radial reflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.Plane
Plane of the reflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.Axis
Axis of the reflection

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByAxial(Autodesk.DesignScript.Geometry.Plane)
Create axial reflection for t-spline symmetry by given plane.
plane: Plane for t-spline axial reflection. Given in World coordinates
Returns: T-Spline axial reflection
tspline,symmetry,reflection,axial

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ByRadial(Autodesk.DesignScript.Geometry.Plane,System.Int32,System.Double)
Create radial reflection for t-spline symmetry by given plane
with given segments count and given angle (in degrees) between each pair of segments.
plane: Plane which normal is axis for t-spline radial reflection. Given in World coordinates
segmentsCount: Number of segments of radial reflection
segmentAngle: Angle between each pair of segments of radial symmetry (in degrees). If is set to 0 it is defined by (360 / segmentsCount)
Returns: T-Spline radial reflection
tspline,symmetry,reflection,radial

Autodesk.DesignScript.Geometry.TSpline.TSplineReflection.ToString
Get a string representation of the TSplineReflection