Autodesk.DesignScript.Geometry.Topology.Vertices
The Vertices of the Topology
Returns:

Autodesk.DesignScript.Geometry.Topology.Edges
The Edges of the Topology
Returns:

Autodesk.DesignScript.Geometry.Topology.Faces
The Faces of the Topology
Returns:

Autodesk.DesignScript.Geometry.Topology.ToString
Get a string representation of the Topology