Autodesk.DesignScript.Geometry.Edge.CurveGeometry
The underlying Curve making up the Edge
Returns: Curve representation of edge

Autodesk.DesignScript.Geometry.Edge.AdjacentFaces
The Faces adjacent to this Edge
Returns: Adjacent faces of edge

Autodesk.DesignScript.Geometry.Edge.StartVertex
The Vertex at which this Edge starts
Returns: Start vertex of edge

Autodesk.DesignScript.Geometry.Edge.EndVertex
The Vertex at which this Edge ends
Returns: End vertex of edge

Autodesk.DesignScript.Geometry.Edge.CoEdges
The CoEdges associated with this Edge
Returns:

Autodesk.DesignScript.Geometry.Edge.ToString
Get a string representation of the Edge