Autodesk.DesignScript.Geometry.PanelSurface.NumVertices
Returns the number of vertices in the PanelSurface.
Returns: number of vertices

Autodesk.DesignScript.Geometry.PanelSurface.NumPanels
Returns the number of panels in the PanelSurface.
Returns: number of panels

Autodesk.DesignScript.Geometry.PanelSurface.GetNumPanelVertices(System.Int32[])
Returns the number of vertices for each panel in the list of panel indices.
panelIndices: List of panel indices to query number of vertices for. The default value of null indicates all panels in the surface.
Returns: number of vertices

Autodesk.DesignScript.Geometry.PanelSurface.GetVertex(System.Int32)
Returns the vertex corresponding to the vertex index in the PanelSurface.
vertexIndex: Index of vertex in the PanelSurface
Returns:

Autodesk.DesignScript.Geometry.PanelSurface.GetPoint(System.Int32)
Returns the point corresponding to the vertex index in the PanelSurface.
vertexIndex: Index of vertex in the PanelSurface
Returns:

Autodesk.DesignScript.Geometry.PanelSurface.GetVertexIndex(System.Int32,System.Int32)
Returns the index for a given panel on the input surface and for the vertex inside the panel.
panelIndex: Panel index to query vertex index for
vertexNumber: Vertex number for given panel
Returns: vertex index

Autodesk.DesignScript.Geometry.PanelSurface.GetPanelVertices(System.Int32[])
Returns the vertices for each panel in the list of panel indices.
panelIndices: Panel index to query vertices for. The default value of null indicates all panels in the surface.
Returns: Vertex array

Autodesk.DesignScript.Geometry.PanelSurface.GetPanelPoints(System.Int32[])
Returns the points for each panel in the list of panel indices.
panelIndices: Panel indices to query points for. The default value of null indicates all panels in the surface.
Returns: Point Array

Autodesk.DesignScript.Geometry.PanelSurface.GetPanelPolygon(System.Int32[])
Returns the polygonal boundary for each panel in the list of panel indices.
panelIndices: Panel indices used to construct Polygon. The default value of null indicates all panels in the surface.
Returns:

Autodesk.DesignScript.Geometry.PanelSurface.SetTransform(System.Double,System.Double,System.Double,System.Double,Autodesk.DesignScript.Geometry.Point)
Applies a uniform scaling, translation and rotation transformation to the given PanelSurface.
scale: Uniform UV scaling factor.
uOffset: Offset in U direction used to translate panels.
vOffset: Offset in V direction used to translate panels.
rotation: Angle of rotation of panels in degrees.
rotationPoint: 2D point about which to rotate all panels.
Returns: Transformed PanelSurface.

Autodesk.DesignScript.Geometry.PanelSurface.ByQuads(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a square tiling pattern.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, quad

Autodesk.DesignScript.Geometry.PanelSurface.ByCrossSplitSquares(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a square grid, with each square split into four triangles by its diagonals.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, cross, split, square

Autodesk.DesignScript.Geometry.PanelSurface.ByDiagonallySplitSquares(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a square grid, with each square split into two triangles by a diagonal. By default, the diagonal is from the bottom left corner to the top right corner.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
alternativeDiagonal: When set to True, the diagonal is from the top left corner to the bottom right corner of each square
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, diagonally, split, square

Autodesk.DesignScript.Geometry.PanelSurface.ByDiamonds(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a diamond-shaped pattern.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, diamond

Autodesk.DesignScript.Geometry.PanelSurface.BySplitDiamonds(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a diamond-shaped pattern, with each diamond split vertically or horizontally into two triangles. By default, each diamond is split vertically.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
splitHorizontally: When set to true, diamond is split horizontally
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, split, diamond

Autodesk.DesignScript.Geometry.PanelSurface.ByParallelograms(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Double,System.Boolean,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in parallelograms tiled vertically and horizontally. Each parallelogram is a square with a shear applied along the V-axis or U-axis determined by the ‘alignWithUAxis’ input and a shear factor. By default the parallelograms are aligned with the V-axis
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
shearFactor: The amount of shear
alignWithUAxis: When set to True, paralellograms are aligned with the U-Axis
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, parallelogram

Autodesk.DesignScript.Geometry.PanelSurface.ByStaggeredQuads(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Boolean,System.Double,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a staggered square pattern. By default, the pattern is staggered horizontally.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
staggerVertically: When set to True, pattern is staggered vertically.
displacementFactor: The amount of displacement
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, staggered, quad

Autodesk.DesignScript.Geometry.PanelSurface.ByHexagons(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a hexagonal tiling pattern.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, hexagon

Autodesk.DesignScript.Geometry.PanelSurface.ByRhombiTriHexagonals(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface in a tiling with one triangle, two squares, and one hexagon at each vertex.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, rhombus, tri, hexagon

Autodesk.DesignScript.Geometry.PanelSurface.ByCustomOrthogonalLattice(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Int32,System.Double,System.Double,Autodesk.DesignScript.Geometry.UV[][],Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition)
Panels the input surface with a custom tiling pattern. The tiles are polygons in UV parameter space. They can be non-convex but must not self-intersect. It is not compulsory for the set of tiles to be touching edge-to-edge. The paneling pattern is generated by displacing copies of the tiles along the u and v directions by the supplied displacements. The UV coordinates of the vertices of each tile are provided in the tileUVs argument.
surface: Input surface to be paneled
numU: Number of patterns in the U direction
numV: Number of patterns in the V direction
uDisplacement: The displacement of the tiling along the u-axis.
vDisplacement: The displacement of the tiling along the v-axis.
tileUVs: Doubly nested list of UV coordinates of each tile in custom pattern where the outer list is the list of tiles (polygons), while the inner lists contain UV coordinates of each tile.
boundaryCondition: Keep, Remove, or RemoveVertices
Returns:
panel, surface, custom, orthogonal, lattice

Autodesk.DesignScript.Geometry.PanelSurface.ToString
Get a string representation of the PanelSurface