Autodesk.DesignScript.Geometry.Plane.Origin
Returns the origin of the Plane.
position,planecenter

Autodesk.DesignScript.Geometry.Plane.Normal
Returns the normal direction of the Plane.
perpendicular

Autodesk.DesignScript.Geometry.Plane.XAxis
The X basis of the Plane

Autodesk.DesignScript.Geometry.Plane.YAxis
The Y basis of the Plane

Autodesk.DesignScript.Geometry.Plane.ToCoordinateSystem
Produces a new CoordinateSystem representing this plane. It is based on
the origin, and X and Y axis basis.
Returns:
converttoCS,convert2cs

Autodesk.DesignScript.Geometry.Plane.Offset(System.Double)
Create a new Plane offset by this Plane in the normal direction by
the specified distance.
alongnormal,moveplane

Autodesk.DesignScript.Geometry.Plane.ByOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Create a Plane centered at root Point, with input normal Vector.
origin: Origin point of plane
normal: Normal direction vector of plane
Returns: Plane created by origin and normal
plane,tonormal

Autodesk.DesignScript.Geometry.Plane.ByOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create an "oriented" Plane, positioned at Point origin with Vector
normal, but with a specific X axis orientation. This has no impact
to splitting, intersect, project, etc operations, it only specifies
the orientation of the input CoordinateSystem.
origin: Origin point of plane
normal: Normal direction vector
xAxis: X axis direction vector
Returns: Plane by origin normal and x axis

Autodesk.DesignScript.Geometry.Plane.ByOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
The X and Y axis lie in the plane. The Z axis is the cross product of the two Vectors.
origin: Origin point of plane
xAxis: X axis direction vector of plane
yAxis: Y axis direction vector of plane
Returns: Plane created by origin x axis and y axis

Autodesk.DesignScript.Geometry.Plane.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Fits a Plane to the input Points; basically a 3D scatterplot fit.
points: List of points to define plane
Returns: Plane created by best fit through points
fit,bestfit

Autodesk.DesignScript.Geometry.Plane.ByLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point)
Create the Plane containing the input Line and external Point. Point
cannot lie on the Line or in the Line axis.
line: Line used to determine plane
point: Point used to determine plane
Returns: Plane created from line and point
lines
0.4

Autodesk.DesignScript.Geometry.Plane.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create a the Plane containing the three input Points.
origin: The plane origin
planePoint: Any point lying on the plane
xAxisPoint: The point lying on the X-axis of the plane wrt to the plane origin

Autodesk.DesignScript.Geometry.Plane.XY
Creates a plane in the world XY
Returns: Plane at XY plane of world

Autodesk.DesignScript.Geometry.Plane.XZ
Creates a plane in the world XZ plane
Returns: Plane at XZ plane of world

Autodesk.DesignScript.Geometry.Plane.YZ
Creates a plane in the world YZ
Returns: Plane at YZ plane of world

Autodesk.DesignScript.Geometry.Plane.ToString
Get a string representation of the Plane