Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.IsRadial
Whether newly created t-spline has radial symmetry.

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.XAxis
Whether newly created t-spline has symmetry on x axis.

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.YAxis
Whether newly created t-spline has symmetry on y axis.

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.ZAxis
Whether newly created t-spline has symmetry on z axis.

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.RadialSymmetryFaces
Number of faces in symmetry segment. Only available if t-spline has radial symmetry.

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.ByRadial(System.Int32)
Create a radial TSplineInitialSymmetry with given amount of spans per symmetric segment.
tspline,symmetry

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.ByAxial(System.Boolean,System.Boolean,System.Boolean)
Create an axial TSplineInitialSymmetry with given symmetry axes.
tspline,symmetry

Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry.ToString
Get a string representation of the TSplineInitialSymmetry