Autodesk.DesignScript.Geometry.Ellipse.CenterPoint
The center of the Ellipse

Autodesk.DesignScript.Geometry.Ellipse.MajorAxis
The major axis of the Ellipse.  This is the longer axis.  The length of the Vector is the Major radius.

Autodesk.DesignScript.Geometry.Ellipse.MinorAxis
The minor axis of the Ellipse.  This is the shorter axis.  The length of the Vector is the Minor radius.

Autodesk.DesignScript.Geometry.Ellipse.ByOriginRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Create an Ellipse centered at input Point, aligned with WCS XY Plane,
with specified X and Y axis radii.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by origin and radii
ellipse

Autodesk.DesignScript.Geometry.Ellipse.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create an Ellipse centered at input Point, with two specified axes.
Axes should be be at 90 degrees to each other.
origin: Origin point of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from origin vectors
ellipsebylengths,ellipsebyvectors

Autodesk.DesignScript.Geometry.Ellipse.ByCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Create an Ellipse centered and aligned with input CoordinateSystem,
with a x_radius radius in the CS X direction, and y_radius radius in the
CS Y direction.
origin: Origin coordinate system of ellipse
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created by coordinate system and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ByPlaneRadii(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Create an Ellipse centered and aligned with input Plane, with a x_radius
radius in the Plane X axis direction, and y_radius radius in the
Plane Y axis direction.
plane: Plane where ellipse arc is drawn
xAxisRadius: X axis radius
yAxisRadius: Y axis radius
Returns: Ellipse created from plane and radii
ellipse,aligned ellipse,ellipsebylengths

Autodesk.DesignScript.Geometry.Ellipse.ToString
Get a string representation of the Ellipse