Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition
The type of boundary condition applied to panels in a mesh.

Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition.Keep
Allow panels to overlap the boundary.

Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition.Remove
Do not allow panels to overlap the boundary.

Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition.RemoveVertices
Remove vertices that do not lie on the input FACE.

Autodesk.DesignScript.Geometry.PanelSurfaceBoundaryCondition.Trim
Trim overlapping panels to surface boundary.