ProtoGeometryGenerator.OverrideCompareUsingAttribute
This attribute lets a class override the CompareUsing attribute on the defining interface
(or set one at all if it is missing). This in turn lets the generator create the
(Get|Compute)HashCode and Equals methods for the class based on the supplied property names.

ProtoGeometryGenerator.OverrideCompareUsingAttribute.#ctor(System.String[])
This attribute lets a class override the CompareUsing attribute on the defining interface
(or set one at all if it is missing). This in turn lets the generator create the
(Get|Compute)HashCode and Equals methods for the class based on the supplied property names.