Autodesk.DesignScript.Geometry.Properties.Resources
A strongly-typed resource class, for looking up localized strings, etc.

Autodesk.DesignScript.Geometry.Properties.Resources.ResourceManager
Returns the cached ResourceManager instance used by this class.

Autodesk.DesignScript.Geometry.Properties.Resources.Culture
Overrides the current thread's CurrentUICulture property for all
resource lookups using this strongly typed resource class.

Autodesk.DesignScript.Geometry.Properties.Resources.ArrayFormatException
Looks up a localized string similar to Given data : \"{0}\" is not an array.

Autodesk.DesignScript.Geometry.Properties.Resources.ConversionException
Looks up a localized string similar to Conversion of backing object to Geometry failed. Could not export SAT..

Autodesk.DesignScript.Geometry.Properties.Resources.coordinatesystem_bymatrix_deprecated
Looks up a localized string similar to This node is deprecated and will be removed in a future version of Dynamo.

Autodesk.DesignScript.Geometry.Properties.Resources.curve_distanceatparameter_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use SegmentLengthAtParameter instead.

Autodesk.DesignScript.Geometry.Properties.Resources.curve_lengthbetweenparams_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use SegmentLengthBetweenParameters instead.

Autodesk.DesignScript.Geometry.Properties.Resources.curve_offset_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use 'OffsetMany' instead..

Autodesk.DesignScript.Geometry.Properties.Resources.curve_sweepassolidsingle_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use SweepAsSolid(ICurveEntity path, bool cutEndOff) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.curve_sweepassurface_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Curve.SweepAsSurface(profile, path, cutEndOff) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.curve_trimsegmentsbyparam_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Curve.TrimSegmentsByParameter(double[] parameters, bool discardEvenSegments) instead..

Autodesk.DesignScript.Geometry.Properties.Resources.CurveNotClosed
Looks up a localized string similar to the curve is not closed.

Autodesk.DesignScript.Geometry.Properties.Resources.CurveNotPlanar
Looks up a localized string similar to the curve is not planar.

Autodesk.DesignScript.Geometry.Properties.Resources.DistanceNotEqual
Looks up a localized string similar to the distance between {0} and {1} are not equal.

Autodesk.DesignScript.Geometry.Properties.Resources.DoesNotExist
Looks up a localized string similar to {0} doesn't exist.

Autodesk.DesignScript.Geometry.Properties.Resources.EqualGeometry
Looks up a localized string similar to the {0} and the {1} are equal or at the same location.

Autodesk.DesignScript.Geometry.Properties.Resources.FileNotFound
Looks up a localized string similar to Failed to locate File: {0}.

Autodesk.DesignScript.Geometry.Properties.Resources.geometry_deserializefromsab_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Please use overload that allows passing mmPerUnit.

Autodesk.DesignScript.Geometry.Properties.Resources.geometry_importfromsat_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use overload that specifies mm per unit.

Autodesk.DesignScript.Geometry.Properties.Resources.GreaterThan
Looks up a localized string similar to the {0} is greater than {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.InvalidArguments
Looks up a localized string similar to the {0} is invalid.

Autodesk.DesignScript.Geometry.Properties.Resources.InvalidDataFormatException
Looks up a localized string similar to Invalid data : {0} for parameter {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.InvalidInput
Looks up a localized string similar to the input {0} is invalid for {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.InvalidIntersect
Looks up a localized string similar to {0} cannot intersect with {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.InvalidOperationException
Looks up a localized string similar to Can't locate Geometry constructor for type: {0}..

Autodesk.DesignScript.Geometry.Properties.Resources.InvalidProjection
Looks up a localized string similar to {0} cannot project on {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.IsParallel
Looks up a localized string similar to the {0} and {1} are parallel for {2}.

Autodesk.DesignScript.Geometry.Properties.Resources.IsZero
Looks up a localized string similar to the {0} is zero.

Autodesk.DesignScript.Geometry.Properties.Resources.IsZeroAngle
Looks up a localized string similar to the {0} angle is zero.

Autodesk.DesignScript.Geometry.Properties.Resources.IsZeroDistance
Looks up a localized string similar to the distance between the {0} and the {1} is zero.

Autodesk.DesignScript.Geometry.Properties.Resources.IsZeroLength
Looks up a localized string similar to the length is zero.

Autodesk.DesignScript.Geometry.Properties.Resources.IsZeroRadius
Looks up a localized string similar to the radius is zero.

Autodesk.DesignScript.Geometry.Properties.Resources.IsZeroVector
Looks up a localized string similar to the input {0}  is zero.

Autodesk.DesignScript.Geometry.Properties.Resources.LessThan
Looks up a localized string similar to the {0} is less than {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.LessThanZero
Looks up a localized string similar to the {0} is less than zero.

Autodesk.DesignScript.Geometry.Properties.Resources.mesh_bypointsfaceindices_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Mesh.ByPointsIndexGroups (Point[] points, IndexGroups : IndexGroup[]) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.mesh_byverticesandindices_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Mesh.ByPointsIndices (Point[] points, Indices : int[]) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.MeshPrecisionInfo
Looks up a localized string similar to Mesh nodes use 32-bit precision (7 decimal places), which may lead to rounding errors with large numbers or numbers with more than 7 decimal places. For higher precision (64-bit, 15 decimal places), use nodes from the Geometry library..

Autodesk.DesignScript.Geometry.Properties.Resources.ModelerExtentsExceeded
Looks up a localized string similar to You have exceeded the allowable modeling extents, consider choosing smaller values as inputs.

Autodesk.DesignScript.Geometry.Properties.Resources.NoImplementationException
Looks up a localized string similar to No implementation of IGeometryFactory found.  Make sure ProtoGeometry.config is properly configured..

Autodesk.DesignScript.Geometry.Properties.Resources.NoParameterNameException
Looks up a localized string similar to WriteObject without parameter name is not supported for {0}.

Autodesk.DesignScript.Geometry.Properties.Resources.NotEqual
Looks up a localized string similar to the {0} is not equal to {2}.

Autodesk.DesignScript.Geometry.Properties.Resources.NotSupported
Looks up a localized string similar to {0} is not supported for {1}.

Autodesk.DesignScript.Geometry.Properties.Resources.NullArgument
Looks up a localized string similar to the {0} is null.

Autodesk.DesignScript.Geometry.Properties.Resources.NullIDesignScriptEntityException
Looks up a localized string similar to DesignScriptEntity can't be created with null IDesignScriptEntity.

Autodesk.DesignScript.Geometry.Properties.Resources.OperationFailed
Looks up a localized string similar to {0} operation failed.

Autodesk.DesignScript.Geometry.Properties.Resources.OutsideAllowableModelingRange
Looks up a localized string similar to Inputs are outside the currently selected modeling range, which may cause issues. To update the range, click the Workspace Geometry Scaling button below the navigation controls and select {0} (modeling range between {1} and {2}).

Autodesk.DesignScript.Geometry.Properties.Resources.OwnerExistingException
Looks up a localized string similar to Input host already has owner assigned to it. DesignScriptEntity can't be created with it..

Autodesk.DesignScript.Geometry.Properties.Resources.ParameterFormatException
Looks up a localized string similar to The data for parameter : {0} is not in {1} format..

Autodesk.DesignScript.Geometry.Properties.Resources.ParameterizedCollectionException
Looks up a localized string similar to Given data : \"{0}\" is not an array of name value pairs.

Autodesk.DesignScript.Geometry.Properties.Resources.point_project_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use Geometry.ProjectPointsOnto(Point[] points, Vector projectionDirection) instead..

Autodesk.DesignScript.Geometry.Properties.Resources.PointsCoincident
Looks up a localized string similar to {0} are coincident.

Autodesk.DesignScript.Geometry.Properties.Resources.PointsColinear
Looks up a localized string similar to {0} are colinear.

Autodesk.DesignScript.Geometry.Properties.Resources.polycurve_bygroupedcurves_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use PolyCurve.ByGroupedCurves(Curve[] curves, double joinTolerance, bool trimCurves, double trimLength) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.polycurve_byjoinedcurves_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use PolyCurve.ByJoinedCurves(Curve[] curves, double joinTolerance, bool trimCurves, double trimLength) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.polycurve_bythickeningcurve_depreacted
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use PolyCurve.ByThickeningCurveNormal(Curve curve, double thickness, Vector normal) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.polycurve_offset_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use PolyCurve.OffsetMany instead..

Autodesk.DesignScript.Geometry.Properties.Resources.PolyCurveDirectionalityInfoMessage
Looks up a localized string similar to PolyCurve direction has been updated for consistency. This change may break this node in pre-4.0 graphs. To retain legacy behavior, set DefaultEnableLegacyPolyCurveBehavior to true in DynamoPreferences.xml..

Autodesk.DesignScript.Geometry.Properties.Resources.polygon_points_deprecated
Looks up a localized string similar to This property is deprecated and will be removed in a future version of Dynamo. Use PolyCurve.Points instead..

Autodesk.DesignScript.Geometry.Properties.Resources.SATFileExportedException
Looks up a localized string similar to SAT file exported to an unexpected location..

Autodesk.DesignScript.Geometry.Properties.Resources.SessionMismatchException
Looks up a localized string similar to Session mismatch for begin and end execution call..

Autodesk.DesignScript.Geometry.Properties.Resources.Sheared
Looks up a localized string similar to {0} is sheared.

Autodesk.DesignScript.Geometry.Properties.Resources.solid_bysweep_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use SolidBySweep(ICurveEntity profile, ICurveEntity path, bool cutEndOff) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.surface_bysweep_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use SurfaceBySweep(ICurveEntity profile, ICurveEntity path, bool cutEndOff) instead.

Autodesk.DesignScript.Geometry.Properties.Resources.surface_joinarr_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use PolySurface.ByJoinedSurfaces node instead..

Autodesk.DesignScript.Geometry.Properties.Resources.surface_tonurbs_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use ToNurbsSurface(bool limitSurface) instead..

Autodesk.DesignScript.Geometry.Properties.Resources.surface_trimwithedgeloops_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future Dynamo release. Use Surface.TrimWithEdgeLoops(PolyCurve[] loops, double tolerance) instead..

Autodesk.DesignScript.Geometry.Properties.Resources.tsplinessurface_creatchmatch_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use CreateMatch(
IEnumerable<TSplineEdge> tsEdges, IEnumerable<Edge> brepEdges, Int32 continuity, Boolean useArclength,
Boolean useRefinement, Int32 numRefinementSteps, Double refinementTolerance, Boolean usePropagation,
Double widthOfPropagation, Double scale, Boolean flipSourceTargetAlignment) instead.
.

Autodesk.DesignScript.Geometry.Properties.Resources.tsplinessurface_creatchmatch_deprecated2
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use CreateMatch(
IEnumerable<TSplineEdge> tsEdges, IEnumerable<Curve> curves, Int32 continuity, Boolean useArclength,
Boolean useRefinement, Int32 numRefinementSteps, Double refinementTolerance, Boolean usePropagation,
Double widthOfPropagation, Double scale, Boolean flipSourceTargetAlignment) instead.
.

Autodesk.DesignScript.Geometry.Properties.Resources.tsplinesurface_buildpipes_deprecated
Looks up a localized string similar to This method is deprecated and will be removed in a future version of Dynamo. Use  TSplineSurfaceBuildPipes(ICurveEntity[] curves, double defaultRadius, double snappingTolerance, int[] segmentCounts, bool autoHandleStart, bool autoHandleEnd, double[] startRotations, double[] endRotations, double[] startRadii, double[] endRadii, double[] startPositions, double[] endPositions, bool inSmoothMode) instead
.