Autodesk.DesignScript.Geometry.Cylinder.Radius
The radius of the cylinder

Autodesk.DesignScript.Geometry.Cylinder.Height
The total height
cylinder

Autodesk.DesignScript.Geometry.Cylinder.Axis
Axis of the cylinder
cylinder

Autodesk.DesignScript.Geometry.Cylinder.ByRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Construct a Solid Cylinder defined by a parent CoordinateSystem, the radius, and the height of the cylinder
coordinateSystem: Parent coordinate system
radius: Radius size
height: Cylinder height
Returns: Cylinder created from radius and height
cylinder,tube

Autodesk.DesignScript.Geometry.Cylinder.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Construct a Solid Cylinder given the bottom and top center point of the Cylinder.
startPoint: Start point of cylinder
endPoint: End point of cylinder
radius: Radius  of cylinder
Returns: Cylinder created by points and radius
cylinder,tube,by center points

Autodesk.DesignScript.Geometry.Cylinder.ToString
Get a string representation of the Cylinder