ProtoGeometryGenerator.GenerateOverrideAttribute
Replace the body of the named property or method with this implementation.
Remarks:
Properties and methods implemented by the generator using the ProtoGeometryGenerator.GenerateFromInterfaceAttribute can
be overriden. This attribute will replace the body of the generated method, but let the generator handle
documentation, scaling, ASM extents checks and the required boilerplate.
overrideName: The method or property to override
virtualKeyword: Implement the generated function as virtual

ProtoGeometryGenerator.GenerateOverrideAttribute.#ctor(System.String,System.Boolean)
Replace the body of the named property or method with this implementation.
Remarks:
Properties and methods implemented by the generator using the ProtoGeometryGenerator.GenerateFromInterfaceAttribute can
be overriden. This attribute will replace the body of the generated method, but let the generator handle
documentation, scaling, ASM extents checks and the required boilerplate.
overrideName: The method or property to override
virtualKeyword: Implement the generated function as virtual