Autodesk.DesignScript.Geometry.Point.X
Get the X component of a Point

Autodesk.DesignScript.Geometry.Point.Y
Get the Y component of a Point

Autodesk.DesignScript.Geometry.Point.Z
Get the Z component of a Point

Autodesk.DesignScript.Geometry.Point.AsVector
Get the Vector with the same X, Y, and Z component
convertovector,point2vector

Autodesk.DesignScript.Geometry.Point.Add(Autodesk.DesignScript.Geometry.Vector)
Add a vector to a point.  The same as Translate(Vector).
movepoint,move,move along

Autodesk.DesignScript.Geometry.Point.Subtract(Autodesk.DesignScript.Geometry.Vector)
Subtract a vector from a point.  The same as Translate(-Vector).
movepoint,move,move along

Autodesk.DesignScript.Geometry.Point.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Project another piece of Geometry onto this along a given direction Vector

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double)
Form a Point in the XY plane given two 2 cartesian coordinates.  The Z component is 0.
x: X coordinate
y: Y coordinate
Returns: Point created by coordinates
xy,position

Autodesk.DesignScript.Geometry.Point.Origin
Get the Origin point (0,0,0)
Returns: Origin point
zero, origin

Autodesk.DesignScript.Geometry.Point.ByCoordinates(System.Double,System.Double,System.Double)
Form a Point given 3 cartesian coordinates
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point created by coordinates
point,xyz,position

Autodesk.DesignScript.Geometry.Point.ByCartesianCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Form a Point in the given coordinate system with 3 cartesian coordinates
coordinateSystem: Parent coordinate system
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns: Point at cartesian coordinates
point,xyz,localposition

Autodesk.DesignScript.Geometry.Point.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Form a Point in the given coordinate system given its position in cylindrical coordinates.
coordinateSystem: Coordinate system to build the point in
angle: The angle is the rotation from the X axis in the coordinate system around the Z axis in degrees
elevation: The elevation of the point above the XY plane
radius: The distance from the origin of the coordinate system
Returns: Point at cylindrical coordinates
point,localposition

Autodesk.DesignScript.Geometry.Point.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Form a Point in the given coordinate system given its position in spherical coordinates.
coordinateSystem: Coordinate system to build the point in
phi: The angle down from the Z axis in degrees
theta: The rotation around the sphere from the X axis in degrees
radius: The offset from the origin
Returns: Point at spherical coordinates
point,localposition

Autodesk.DesignScript.Geometry.Point.PruneDuplicates(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double)
Prune points to exclude duplicates within tolerance of included points
points:  List of points from which to prune duplicates
tolerance:  Tolerance used for pruning
Returns: Unique points
unique,duplicates,remove duplicates,distinct,near

Autodesk.DesignScript.Geometry.Point.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compare two Point's
other: The other Point
Returns: Whether the two objects are equal

Autodesk.DesignScript.Geometry.Point.ComputeHashCode
Get a hashcode for this type
Returns:  A unique hashcode for this object

Autodesk.DesignScript.Geometry.Point.ToString
Get a string representation of the Point