Autodesk.DesignScript.Geometry.EllipseArc.CenterPoint
The center of the Ellipse
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.MajorAxis
The major axis of the Ellipse.  This is the longer axis.  The length of the Vector is the Major radius.
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.MinorAxis
The minor axis of the Ellipse.  This is the shorter axis.  The length of the Vector is the Minor radius.
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.StartAngle
The start angle in degrees
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.SweepAngle
Returns the sweep angle of the ellipse arc in degrees.
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.Plane
The plane in which the ellipse lies
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ByPlaneRadiiAngles(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double,System.Double)
Create an EllipseArc in a plane with the given the radii along the X and Y axes and the angles to sweep through
plane: Plane containing the ellipse arc
xRadius: The radius of the EllipseArc in the X direction of the Plane
yRadius: The radius of the EllipseArc in the Y direction of the Plane
startAngle: The start angle of the arc as measured from the positive x-axis of the input plane
sweepAngle: The angle to sweep from the start angle in degrees
Returns: Ellipse arc created by plane radii and angles
ellipsearc,arcs

Autodesk.DesignScript.Geometry.EllipseArc.ToString
Get a string representation of the EllipseArc