Autodesk.DesignScript.Geometry.GeometryExtension.ClipParamRange(System.Double@)
Clips parameter between 0 and 1
param: Input parameter
Returns: Boolean to indicate if parameter was clipped

Autodesk.DesignScript.Geometry.GeometryExtension.LocateFile(System.String)
Locates given file from pre-defined search path set to this system
fileName: File name to locate.
Returns: Full path for the given file.
true