ProtoGeometryGenerator.GenerateFromInterfaceAttribute
The ProtoGeometryGenerator.GenerateFromInterfaceAttribute is the main attribute the generator looks for when it is
deciding the classes to auto implement. The protoInterface type should
be a type from Autodesk.DesignScript.Interfaces and geometryFactoryInterface should
be the source of all the static constructor methods for the interface.
The attribute must be attached to a class that matches the protoInterface name, i.e. if the interface
is named IPointEntity, then the class must be named Point for the generator to work correctly.
The generator will implement wrappers for every property and method on protoInterface
using ProtoGeometry as instance methods. In addition, all methods that start with the class name
(Point) on the factory interface will be implemented as static methods.
Generated implementations can be overriden by implementing a property or method that exactly matches the
interface method signature. See ProtoGeometryGenerator.GenerateShadowingAttribute and ProtoGeometryGenerator.GenerateOverrideAttribute for
other ways to override automatic implementations.

ProtoGeometryGenerator.GenerateFromInterfaceAttribute.#ctor(System.Type,System.Type,System.Type[])
The ProtoGeometryGenerator.GenerateFromInterfaceAttribute is the main attribute the generator looks for when it is
deciding the classes to auto implement. The protoInterface type should
be a type from Autodesk.DesignScript.Interfaces and geometryFactoryInterface should
be the source of all the static constructor methods for the interface.
The attribute must be attached to a class that matches the protoInterface name, i.e. if the interface
is named IPointEntity, then the class must be named Point for the generator to work correctly.
The generator will implement wrappers for every property and method on protoInterface
using ProtoGeometry as instance methods. In addition, all methods that start with the class name
(Point) on the factory interface will be implemented as static methods.
Generated implementations can be overriden by implementing a property or method that exactly matches the
interface method signature. See ProtoGeometryGenerator.GenerateShadowingAttribute and ProtoGeometryGenerator.GenerateOverrideAttribute for
other ways to override automatic implementations.