Autodesk.DesignScript.Geometry.Loop.Face
The containing Face of the Loop
Returns:

Autodesk.DesignScript.Geometry.Loop.CoEdges
The CoEdges contained in the Loop
Returns:

Autodesk.DesignScript.Geometry.Loop.IsExternal
Whether the loop is border or inner

Autodesk.DesignScript.Geometry.Loop.ToString
Get a string representation of the Loop