Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.Vertices
Vertices contained in this T-Spline Surface.

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.Edges
Edges contained in the T-Spline Surface.

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.Faces
Faces contained in the T-Spline Surface.

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.RegularVertices
Regular Vertices contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.StarPointVertices
Star-Point Vertices contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.TPointVertices
T-Point Vertices contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.NonManifoldVertices
Non-Manifold Vertices contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.BorderVertices
Border Vertices contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.InnerVertices
Inner Vertices contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.NonManifoldEdges
Non-Manifold Edges contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.BorderEdges
Border Edges contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.InnerEdges
Inner Edges contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.RegularFaces
Regular Faces contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.NGonFaces
N-Gon Faces contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.BorderFaces
Border Faces contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.InnerFaces
Inner Faces contained in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VerticesCount
Return number of vertices in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgesCount
Return number of edges in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FacesCount
Return number of faces in the T-Spline Surface

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.DecomposedVertices
Decomposed Vertices differed by type
Returns: Set of vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.DecomposedEdges
Decomposed Edges differed by type
Returns: Set of edges

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.DecomposedFaces
Decomposed Faces differed by type
Returns: Set of faces

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.VertexByIndex(System.Int32)
Return vertex at given index
index: Index to get vertex at
tspline,face,byindex
Returns: T-Spline Vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.EdgeByIndex(System.Int32)
Return edge at given index
index: Index to get edge at
tspline,face,byindex
Returns: T-Spline Edge

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.FaceByIndex(System.Int32)
Return face at given index
index: Index to get face at
tspline,face,byindex
Returns: T-Spline Face

Autodesk.DesignScript.Geometry.TSpline.TSplineTopology.ToString
Get a string representation of the TSplineTopology