Autodesk.DesignScript.Geometry.Circle.CenterPoint
The center of the circle

Autodesk.DesignScript.Geometry.Circle.Radius
Returns the radius of the circle.

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Creates a Circle with input center Point and radius in the world XY
plane, with world Z as normal.
centerPoint: Center point of circle
radius: Radius
Returns: Circle created with center point and radius
circle

Autodesk.DesignScript.Geometry.Circle.ByCenterPointRadiusNormal(Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
Creates a Circle with specified center Point, radius, and normal direction.
centerPoint: Center point of circle
radius: Radius
normal: Normal direction vector
Returns: Circle created with center point radius and normal
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByPlaneRadius(Autodesk.DesignScript.Geometry.Plane,System.Double)
Create a Circle centered at the input Plane origin (root), lying in
the input Plane, with given radius.
plane: Root of plane used to center circle
radius: Radius
Returns: Circle created with plane and radius
circle,alignedcircle

Autodesk.DesignScript.Geometry.Circle.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create a Circle passing through three input Points.
p1: 1st point of circle
p2: 2nd point of circle
p3: 3rd point of circle
Circle created from three points
circle

Autodesk.DesignScript.Geometry.Circle.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Best fit Circle through Points
points: List of points to fit circle to
Returns: Circle created from points
circle,approximate

Autodesk.DesignScript.Geometry.Circle.ToString
Get a string representation of the Circle