Autodesk.DesignScript.Geometry.Mesh.VerticesAsThreeNumbers
Returns raw vertices of this mesh as a list of numbers. Each set of
three consecutive numbers represents a point.

Autodesk.DesignScript.Geometry.Mesh.EdgesAsSixNumbers
Returns raw vertices of this mesh as a list of numbers. Each set of
six consecutive numbers represents two points

Autodesk.DesignScript.Geometry.Mesh.TrianglesAsNineNumbers
Returns raw vertices of this mesh as a list of numbers. Each set of
nine consecutive numbers represents three points of a triangle

Autodesk.DesignScript.Geometry.Mesh.FromJson(System.String)
Parse the incoming JSON string formatted with dynamo.geometry:mesh-1.0.0 schema.
json: JSON string to parse
Returns: Mesh

Autodesk.DesignScript.Geometry.Mesh.ToJson
Convert the mesh into a JSON object formatted with dynamo.geometry:mesh-1.0.0 schema.
Returns: The resulting JSON string

Autodesk.DesignScript.Geometry.Mesh.FaceIndices
The vertex indices that make up each face in a counterclockwise fashion
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.VertexNormals
The normal vector at this vertex
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.VertexPositions
The positions of the vertices
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.VertexCount
Returns the number of vertices in the Mesh

Autodesk.DesignScript.Geometry.Mesh.EdgeCount
Returns the number of edges in the Mesh

Autodesk.DesignScript.Geometry.Mesh.TriangleCount
Returns the number of triangles in the Mesh

Autodesk.DesignScript.Geometry.Mesh.Volume
Returns the volume of the provided Mesh
volume

Autodesk.DesignScript.Geometry.Mesh.Area
Returns the area of the provided Mesh
area

Autodesk.DesignScript.Geometry.Mesh.VertexIndicesByTri
Returns the vertex indices for each mesh triangle.
(as opposed to unique vertex indices)
List of vertex indices for each mesh triangle.

Autodesk.DesignScript.Geometry.Mesh.Edges
Converts the Mesh edges to Lines, and returns them

Autodesk.DesignScript.Geometry.Mesh.Triangles
Converts the Mesh faces to Surface patches, and returns them. Note:
this method can generate A LOT of heavy Surfaces, and may
slow down Dynamo with large meshes.

Autodesk.DesignScript.Geometry.Mesh.Explode
Converts Mesh triangles to individual meshes and returns them.

Autodesk.DesignScript.Geometry.Mesh.TriangleNormals
Returns the normals for each triangle face in a given mesh.
Returns:

Autodesk.DesignScript.Geometry.Mesh.TriangleCentroids
Returns Triangle Centroids

Autodesk.DesignScript.Geometry.Mesh.BooleanUnion(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh unifying the tool mesh and the original mesh.
tool:
mesh

Autodesk.DesignScript.Geometry.Mesh.BooleanDifference(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh subtracting the tool mesh from the original mesh.
tool:
mesh

Autodesk.DesignScript.Geometry.Mesh.BooleanIntersection(Autodesk.DesignScript.Geometry.Mesh)
Returns a new mesh consisting of the intersection between the tool
mesh and the original mesh.
tool:
mesh

Autodesk.DesignScript.Geometry.Mesh.Repair
Returns a new Mesh with the following defects repaired:
Small components: if the Mesh contains very small, disconnected
segments, relative to the overall Mesh size, they will be
discarded.
Holes: holes in the mesh are filled in
Non-manifold regions: if a vertex is connected to more than
two *boundary* edges, or an edge is connected to more than
two triangles then the vertex / edge is non-manifold. The
mesh toolkit will remove geometry until the mesh is manifold
This method tries to preserve as much of the original mesh as
possible, as opposed to MakeWatertight, which resamples the Mesh

Autodesk.DesignScript.Geometry.Mesh.CloseCracks
Removes internal boundaries of a Mesh. An internal boundary occurs
when there are coincident vertices, such as if Mesh had separate
triangle groups for the lid of a pot and the body of the pot.

Autodesk.DesignScript.Geometry.Mesh.MakeWatertight
Returns a new Mesh that is watertight and 3D printable. As a result of
making a Mesh watertight, self-intersections, overlaps, and non-manifold
geometry is removed from the mesh.
The Mesh is filled with a bunch of tiny boxes, and a new
mesh is created around this.

Autodesk.DesignScript.Geometry.Mesh.MakeHollow(System.Int32,System.Double,System.Double,System.Double,System.Double)
Returns a new Mesh that has been hollowed out for 3D printing.
holeCount: Number of escape holes
holeRadius: Radius of escape holes
wallThickness: Interior offset distance
solidResolution: Resolution for making the solid that represents the interior surface of the hollowed mesh (8 - 4096)
meshResolution: Resolution for mesh generation on the interior surface of the hollowed mesh (8 - 4096)
Hollow mesh

Autodesk.DesignScript.Geometry.Mesh.GenerateSupport(System.Double,System.Double,System.Double,System.Double,System.Double)
Returns a new Mesh with support structure. Default threshold settings are used if input is empty.
baseHeight: Height of the base where the support posts meet the ground
baseDiameter: Diameter of the base where the support posts meet the ground
postDiameter: Diameter of the support posts
tipHeight: Height of the tip where the support posts touch the mesh
tipDiameter: Diameter of the tip where the support posts touch the mesh
Mesh with support structure

Autodesk.DesignScript.Geometry.Mesh.Reduce(System.Double)
Returns a new Mesh with a reduced number of triangles.
triangleCount: Goal triangle count for the reduction
Reduced mesh

Autodesk.DesignScript.Geometry.Mesh.Remesh
Returns a new Mesh distributing triangles more evenly over the whole of the selection
regardless of any change in triangle normals across the given selection.
mesh

Autodesk.DesignScript.Geometry.Mesh.Smooth(System.Double)
Returns a new smooth Mesh. Smoothing type by default is
cotangent which smooths without spreading the vertices.
scale: Sets the "spatial scale" of smoothing. Smaller values yield more
local smoothing, and typically result in a less "smooth" looking result (0.1 - 64.0)
Smooth mesh

Autodesk.DesignScript.Geometry.Mesh.PlaneCut(Autodesk.DesignScript.Geometry.Plane,System.Boolean)
Create a precise geometric planar cut which removes portions of the mesh
that lie on the side of the plane in the direction of the plane normal.
plane: Set plane to use for the cut
makeSolid: Attempt to create a minimal fill using the fewest
number of triangles.
mesh

Autodesk.DesignScript.Geometry.Mesh.Intersect(Autodesk.DesignScript.Geometry.Plane)
Intersects input Plane with the Mesh, producing a PolyCurve

Autodesk.DesignScript.Geometry.Mesh.Project(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Projects point onto the Mesh along the specified direction

Autodesk.DesignScript.Geometry.Mesh.Nearest(Autodesk.DesignScript.Geometry.Point)
Nearest point on the Mesh to the specified point

Autodesk.DesignScript.Geometry.Mesh.Mirror(Autodesk.DesignScript.Geometry.Plane)
Reflect the Mesh across the input Plane

Autodesk.DesignScript.Geometry.Mesh.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotate the Mesh around the input axis by the given angle.

Autodesk.DesignScript.Geometry.Mesh.Scale(System.Double)
Scale the Mesh by the input amount

Autodesk.DesignScript.Geometry.Mesh.Scale(System.Double,System.Double,System.Double)
Scale Mesh non-uniformly by scale factors

Autodesk.DesignScript.Geometry.Mesh.Translate(Autodesk.DesignScript.Geometry.Vector)
Translate a Mesh in the direction of input Vector by the length of the Vector

Autodesk.DesignScript.Geometry.Mesh.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Translate the Mesh in the direction of the input Vector by the input distance

Autodesk.DesignScript.Geometry.Mesh.Translate(System.Double,System.Double,System.Double)
Translates the Mesh by the input distances

Autodesk.DesignScript.Geometry.Mesh.MeshToJson(System.Double)
Convert the mesh into a JSON object formatted with dynamo.geometry:mesh-1.0.0 schema.
Returns: The resulting JSON string

Autodesk.DesignScript.Geometry.Mesh.ByPointsFaceIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Create a mesh from a collection of Points and a collection of IndexGroups referencing the Point collection
vertexPositions: List of points that determine vertex positions
indices: Indices for vertices
Returns: Mesh created from points
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.ByPointsIndexGroups(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.IndexGroup})
Create a mesh from a collection of Points and a collection of IndexGroups referencing the Point collection
points:  List of points
indexGroups:  Index groups for points
Returns:  Mesh
mesh,meshes

Autodesk.DesignScript.Geometry.Mesh.ByPointsIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{System.Int32})
Create a new Mesh from supplied points and indices. Points should
not overlap. Indices should be sets of three integers
indicating the three locations in the points array
of the three points of a triangle
points:  List of points
indices:  Flat list of point indices
Returns:  Mesh

Autodesk.DesignScript.Geometry.Mesh.ImportFile(System.String)
Imports a file, parsing it into a number of Meshes.
Currently supported formats are:
.mix -- Meshmixer
.obj -- Wavefront

Autodesk.DesignScript.Geometry.Mesh.ExportMeshes(System.String,System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Mesh})
Exports meshes to a format determined by file name:
.mix -- Meshmixer
.obj -- Wavefront
.stl -- STL format
.dae -- COLLADA
.ply -- Polygon File Format
This function returns the filename of the output file, which may
need to be changed if it contains non-ascii characters

Autodesk.DesignScript.Geometry.Mesh.ByGeometry(Autodesk.DesignScript.Geometry.Geometry,System.Double,System.Int32)
Convert a Geometry object such as a Solid or Surface into a Mesh.
The resolution of the mesh is determined by the Dynamo render precision

Autodesk.DesignScript.Geometry.Mesh.ByVerticesAndIndices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Collections.Generic.IEnumerable{System.Int32})
Create a new Mesh from supplied vertices and indices. Vertices should
not overlap. Indices should be sets of three integers
indicating the three locations in the vertices array
of the three points of a triangle

Autodesk.DesignScript.Geometry.Mesh.Plane(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32)
Create a mesh plane based on the given inputs.
origin:
xWidth:
yWidth:
xDivisions:
yDivisions:
mesh

Autodesk.DesignScript.Geometry.Mesh.Cuboid(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Create a mesh cuboid based on the current settings.
origin:
length:
width:
height:
xDivisions:
yDivisions:
zDivisions:
mesh

Autodesk.DesignScript.Geometry.Mesh.Sphere(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Boolean)
Create a mesh sphere based on the current settings.
origin:
radius:
divisions:
icosphere:
mesh

Autodesk.DesignScript.Geometry.Mesh.Cone(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Boolean)
Create a mesh cone based on the current settings.
origin:
baseRadius:
topRadius:
height:
divisions:
cap:
mesh

Autodesk.DesignScript.Geometry.Mesh.ExtrudePolyCurve(Autodesk.DesignScript.Geometry.PolyCurve,System.Double,Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Returns a mesh by extruding a 3D polyline.
polycurve: PolyCurve to extrude
height: Height of extrusion
direction: Vector direction for extrusion
cap: Cap mesh extrusion (only if PolyCurve is planar)
mesh