Autodesk.DesignScript.Geometry.Line.Direction
The direction of the Curve
lines

Autodesk.DesignScript.Geometry.Line.ByStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Creates a straight Line between two input Points.
startPoint: Line start point
endPoint: Line end point
Returns: Line from start and end point
line,linebypoints,lines

Autodesk.DesignScript.Geometry.Line.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Creates a Line best approximating a scatter plot of Points.
bestFitPoints: List of points to best fit line
Returns: Line from fit through points
line,approximate,lines

Autodesk.DesignScript.Geometry.Line.ByTangency(Autodesk.DesignScript.Geometry.Curve,System.Double)
Create a Line tangent to the input Curve, positioned at the parameter
Point of the input Curve.
curve: Base curve for tangent line
parameter: Parameter value
Returns: Tangent line
tangentline,tangentto,lines

Autodesk.DesignScript.Geometry.Line.ByStartPointDirectionLength(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Create a straight Line starting at start Point, extending in Vector
direction by specified length.
startPoint: Line start point
direction: Direction vector
length: Length of line
Returns: Line from start direction and length
linebyvector,lines

Autodesk.DesignScript.Geometry.Line.ToString
Get a string representation of the Line