Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.AdjacentEdges
The TSplineEdges emanating from this Vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.AdjacentFaces
The TSplineFaces adjacent to this Vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.UVNFrame
Return UVN Frame of the TSVertex (point on the hull, U vector, V vector and normal)

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.Index
Index of the TSVertex

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.IsStarPoint
Whether the TSVertex is a star point

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.IsTPoint
Whether the TSVertex is a T-point

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.IsManifold
Whether the TSVertex is manifold

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.Valence
Number of edges or faces on the TSVertex

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.FunctionalValence
Functional valence of the TSVertex, taking T-points into account

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.Info
A bunch of TSVertex properties: uvnFrame, index, valence and functionalValence, whether TSVertex is a StarPoint, TPoint, Manifold or not

Autodesk.DesignScript.Geometry.TSpline.TSplineVertex.ToString
Get a string representation of the TSplineVertex