Autodesk.DesignScript.Geometry.PolyCurve.Points
Returns the start point of the first component and the end points of every component curve. For a closed polycurve, as the start and end points are the same, the end point is excluded.

Autodesk.DesignScript.Geometry.PolyCurve.NumberOfCurves
Number of curves of the polycurve
curvecount,subcurvecount,numbersubcurves

Autodesk.DesignScript.Geometry.PolyCurve.Curves
Returns curves of the polycurve
Curves of polycurve
subcurves,polycurvesplit

Autodesk.DesignScript.Geometry.PolyCurve.CurveAtIndex(System.Int32,System.Boolean)
Returns curve of the polycurve by index
index: Length to locate point
endOrStart: True to count from end of polycurve, false to count from start of polycurve
Returns: Curve at index
subcurveatindex,getsubcurve,getcurvebyindex

Autodesk.DesignScript.Geometry.PolyCurve.BasePlane
Returns plane of planar polycurve

Autodesk.DesignScript.Geometry.PolyCurve.CloseWithLine
Close polycurve by line connecting start and end points
lines
0.4

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Create one or more Polycurves by offsetting a planar polycurve by the given distance in a plane defined by the plane normal.
The "planeNormal" input argument defaults to the normal of the plane containing the curve but an explicit normal parallel to the original curve normal can be provided to better control the direction of the offset.
For example, if a consistent offset direction is required for multiple curves sharing the same plane, the "planeNormal" can be used to override individual curve normals and force all curves to be offset in the same direction.
Reversing the normal reverses the direction of the offset.
signedDistance: A positive offset distance applies in the direction of the cross product between the polycurve's tangent and the plane's normal vector, while a negative offset applies in the opposite direction.
extendCircular: If there are gaps between the offset component curves then, depending on the gap closure settings, they may be filled either by circular arcs (true value) to give smooth corners, or by extending (false value) the offset curves.
planeNormal:  The curve's plane normal. Defaults to the input curve's plane normal
Returns: One or more offset polycurves

Autodesk.DesignScript.Geometry.PolyCurve.Fillet(System.Double,System.Boolean)
Fillet corners of planar polycurve.
radius: Radius of fillet
clockwise_corners: Indicates which corners should be filleted, if it is true then corners where the tangent at the start of the second component is clockwise from the tangent at the end of the first component (relative to the curve normal) will get filleted. If it is false then anti-clockwise corners will get filleted.
Returns: Filleted polyCurve
round,smooth,radius

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Make one or more polycurves by grouping connected curves.

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithEllipse(System.Double,System.Double,System.Double,System.Double,System.Boolean)
Extends polycurve by tangent ellipse
length: Length of extension ellipse
radius1: Parameter of ellipse
radius2: Parameter of ellipse
endEllipseParameter: Parameter of ellipse
endOrStart:  extending end or start of the polycurve

Autodesk.DesignScript.Geometry.PolyCurve.ExtendWithArc(System.Double,System.Double,System.Boolean)
Extends polycurve by tangent arc.
length: Length of extension arc
radius: Radius of arc
endOrStart:  extending end or start of the polycurve

Autodesk.DesignScript.Geometry.PolyCurve.CloseWithLineAndTangentArcs(System.Double,System.Double)
Close polycurve by tangent chain of arc, line, and arc
radiusAtStart: Radius of arc at start of polycurve
radiusAtEnd: Radius of arc at end of polycurve
lines
0.4

Autodesk.DesignScript.Geometry.PolyCurve.Offset(System.Double,System.Boolean)
Offset polycurve in its plane.
signedDistance: Amount to offset
extendCircular: Toggle to make corners circular
Returns: Offseted polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Heals a self-intersecting PolyCurve by returning a new one that isn't self-intersecting
if the overlapping segment length is less than or equal to trimLength.
trimLength: If trimLength is greater than 0 then end segments longer than trimLength will not be trimmed.
Returns: Non-self-intersecting, non-overlapping PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Make PolyCurve by joining curves. Input curves need not be specified in order of connectivity.
PolyCurve direction is based on the first curve in the input array.
Choose a preferred join tolerance between 1e-6 and 1e-3 units.
Lower values may be too strict and prevent curves that should connect from joining; higher values may cause short curves to be unintentionally merged or to collapse to degenerate points.
curves: Curves to join into polycurve
joinTolerance: Tolerance to determine size of gap allowed between curves to be joined
Returns: Polycurve created by joined curves
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Make PolyCurve by joining curves. Input curves need not be specified in order of connectivity.
PolyCurve direction is based on the first curve in the input array.
Choose a preferred join tolerance between 1e-6 and 1e-3 units.
Lower values may be too strict and prevent curves that should connect from joining; higher values may cause short curves to be unintentionally merged or to collapse to degenerate points.
curves: Curves to join into polycurve
joinTolerance: Tolerance to determine size of gap allowed between curves to be joined
trimCurves: Set to True if input curves are intersecting/overlapping each other and need their end segments to be trimmed off before creation of PolyCurve. It is set to False by default.
trimLength: If trimLength is greater than 0 then end segments longer than trimLength will not be trimmed.
Returns: Polycurve created by joined curves
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double)
Make one or more polycurves by grouping connected curves.
Choose a preferred join tolerance between 1e-6 and 1e-3 units.
Lower values may be too strict and prevent curves that should connect from joining; higher values may cause short curves to be unintentionally merged or to collapse to degenerate points.
curves: Curves to group together to create one or more PolyCurves
joinTolerance: Tolerance to determine size of gap allowed between curves to be joined
Returns:

Autodesk.DesignScript.Geometry.PolyCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Make PolyCurve by connecting points. Set the 'connectLastToFirst' input to true to close the PolyCurve.
points: Points to make polycurve
connectLastToFirst: True to connect last point to first point, false to leave open
Returns: Polycurve created by points
segments,joincurves,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.PolyCurve.ByThickeningCurve(Autodesk.DesignScript.Geometry.Curve,System.Double,Autodesk.DesignScript.Geometry.Vector)
Make PolyCurve by thickening a curve.
curve:  the curve to thicken
thickness:  the thickness
nor:  the normal perpendicular to the thickening direction
offset

Autodesk.DesignScript.Geometry.PolyCurve.ByThickeningCurveNormal(Autodesk.DesignScript.Geometry.Curve,System.Double,Autodesk.DesignScript.Geometry.Vector)
Make PolyCurve by thickening a curve along a plane specified by the input normal.
curve:  the curve to thicken
thickness:  the thickness
normal:  the normal perpendicular to the thickening direction. If the normal is not supplied (is null), the curve normal is used by default.
offset,thicken

Autodesk.DesignScript.Geometry.PolyCurve.ToString
Get a string representation of the PolyCurve