Autodesk.DesignScript.Geometry.CoEdge.Previous
The previous CoEdge in the containing Loop
Returns:

Autodesk.DesignScript.Geometry.CoEdge.Next
The next CoEdge in the containing Loop
Returns:

Autodesk.DesignScript.Geometry.CoEdge.Partner
The neighbouring CoEdge in the reverse direction
Returns:

Autodesk.DesignScript.Geometry.CoEdge.Edge
The adjacent Edge associated with the CoEdge
Returns:

Autodesk.DesignScript.Geometry.CoEdge.Loop
The containing Loop to which the CoEdge belongs
Returns:

Autodesk.DesignScript.Geometry.CoEdge.StartVertex
The Vertex at which this Edge starts
Returns:

Autodesk.DesignScript.Geometry.CoEdge.EndVertex
The Vertex at which this Edge ends
Returns:

Autodesk.DesignScript.Geometry.CoEdge.Reversed
The sense of the CoEdge with respect to its Edge
Returns:

Autodesk.DesignScript.Geometry.CoEdge.ParameterCurve
Curve in parametric space of the owner surface. The curve is in 2D form, thus Z coordinates of this curve are 0.
Returns:

Autodesk.DesignScript.Geometry.CoEdge.ToString
Get a string representation of the CoEdge