Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.AdjacentFaces
The TSplineFaces adjacent to this Edge

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.StartVertex
The TSplineVertex at which this Edge starts

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.EndVertex
The Vertex at which this Edge ends

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.UVNFrame
Return UVN Frame of the TSEdge (point on the hull, U vector, V vector and normal)

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.Index
Index of the TSEdge

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.IsBorder
Whether the TSEdge is on border

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.IsManifold
Whether the TSEdge is manifold

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.Info
A bunch of TSEdge properties: uvnFrame and index, whether TSEdge is on Border, is Manifold or not

Autodesk.DesignScript.Geometry.TSpline.TSplineEdge.ToString
Get a string representation of the TSplineEdge