Autodesk.DesignScript.Geometry.Rectangle.Width
The width of the Rectangle
rectX,rectx

Autodesk.DesignScript.Geometry.Rectangle.Height
The height of the Rectangle
rectY,recty

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a Rectangle by four corner Points.
points: List of corner points of rectangle
Returns: Rectangle created by corner points
rectbypointarray

Autodesk.DesignScript.Geometry.Rectangle.ByCornerPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create a Rectangle by four corner Points.
p1: 1st corner point of rectangle
p2: 2nd corner point of rectangle
p3: 3rd corner point of rectangle
p4: 4th corner point of rectangle
Returns: Rectangle created by corner points
rectbypoints

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(System.Double,System.Double)
Create a Rectangle centered at the WCS origin in the WCS XY Plane, with
specified width (X Axis length), and length (Y Axis length).
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double)
Create a Rectangle centered at input Plane root, with input width
(Plane X axis length), and length (Plane Y axis length).
plane: Plane used to center rectangle
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created by width and length
rectangle,rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ByWidthLength(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Create a Rectangle centered at the input origin in the CoordinateSystem
XY Plane, with specified width (X Axis length), and length
(Y Axis length).
coordinateSystem: Coordinate system of rectangle (center of rectangle)
width: Width of rectangle
length: Length of rectangle
Returns: Rectangle created from width and length
rectbylengths

Autodesk.DesignScript.Geometry.Rectangle.ToString
Get a string representation of the Rectangle