Autodesk.DesignScript.Geometry.Core.EntityTags
Tags allow you to add arbitrary metadata to a DesignScriptEntity.  This is critical for Revit
geometry integration.

Autodesk.DesignScript.Geometry.Core.EntityTags.AddTag(System.String,System.Object)
Add or overwrite a Geometry tag
tag:
data:

Autodesk.DesignScript.Geometry.Core.EntityTags.LookupTag(System.String)
Do recursive lookup of geometry tags
name:
Returns: