Autodesk.DesignScript.Geometry.Surface.Area
Returns the total surface area.

Autodesk.DesignScript.Geometry.Surface.Perimeter
Returns the sum of lengths of all boundary edges of the surface.
circumference

Autodesk.DesignScript.Geometry.Surface.ClosedInU
Returns True if surface is closed in U direction, false if it's not.

Autodesk.DesignScript.Geometry.Surface.ClosedInV
Returns True if surface is closed in V direction, false if it's not.

Autodesk.DesignScript.Geometry.Surface.Closed
Returns True if surface is closed in U or V direction, false if it's neither.

Autodesk.DesignScript.Geometry.Surface.SubtractFrom(Autodesk.DesignScript.Geometry.Solid)
Subtract the input tools from this Surface.
difference,trim,removefrom,cut

Autodesk.DesignScript.Geometry.Surface.Difference(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
The boolean difference of this Surface and the union of input Surfaces.
This method might return a polySurface if the resulting boolean is non-manifold or multi-faced.
others: Other surfaces to subtract
Returns: Resulting boolean surface or polySurface
subtract,differencemany,diffall,diff multi

Autodesk.DesignScript.Geometry.Surface.UVParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Return the UV parameter pair at the input Point. This is the inverse of Point at parameter.
evaluateatpoint,surfaceatpoint,uvatpoint,uvs
0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Trims the surface with a collection of one or more closed PolyCurves.
One of the loops needs to be the boundary loop of the input surface.
In addition, one or more inner loops need to be added for holes.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Trims the surface with a collection of one or more closed PolyCurves that must all lie on the surface within the specified tolerance.
If one or more holes need to be trimmed from the input surface, there must be one outer loop specified for the boundary of the surface and one inner loop for each hole.
If the region between the surface boundary and the hole(s) needs to be trimmed, only the loop for each hole should be provided.
For a periodic surface with no outer loop such as a spherical surface, the trimmed region can be controlled by reversing the direction of the loop curve.
loops: One or more closed PolyCurves that can be in any order in the input.These loops should not intersect each other.
tolerance: The tolerance used when deciding whether curve ends are coincident and whether a curve and surface are coincident. The supplied tolerance cannot be smaller than any of the tolerances used in the creation of the input polycurves. The default value of 0.0 means that the largest tolerance used in the creation of the input polycurves will be used.
Returns: Surface trimmed by closed loops.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.NormalAtPoint(Autodesk.DesignScript.Geometry.Point)
Return the surface normal at the input Point on the Surface.
point: Point at which to evaluate surface normal
Returns: Normal at point
perpendicular

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface
Gets a Nurbs representation of the Surface. This method may approximate
Surface in certain circumstances.

Autodesk.DesignScript.Geometry.Surface.ToNurbsSurface(System.Boolean)
Gets a Nurbs representation of the Surface. This method may approximate
Surface in certain circumstances.
limitSurface: Determines if the surface should be restored to its original parameter range before conversion. An example of when the parameter range of a surface is limited is after a Trim operation.

Autodesk.DesignScript.Geometry.Surface.ApproximateWithTolerance(System.Double)
Gets a Nurbs representation of the Surface within a specified tolerance. This method may approximate
Surface in certain circumstances.
tolerance: Specified tolerance
Returns: Nurbs surface representation of surface
tonurbs

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double)
Thicken Surface into a Solid, extruding in the direction of Surface
normals on both sides of the Surface.
thickness: Amount to thicken
Returns: Thickened surface as solid
offset,tosolid

Autodesk.DesignScript.Geometry.Surface.Thicken(System.Double,System.Boolean)
Thicken Surface into a Solid, extruding in the direction of Surface
normals. If both_sides parameter is true, surface is thickened
on both sides.
thickness: Amount to thicken
both_sides: True to thicken on both sides, false to thicken on one side
Returns: Thickened surface as solid
offset,bothsides,tosolid

Autodesk.DesignScript.Geometry.Surface.Offset(System.Double)
Offset Surface in direction of Surface normal by specified distance.
distance: Amount to offset
Returns: Offseted surface

Autodesk.DesignScript.Geometry.Surface.CurvatureAtParameter(System.Double,System.Double)
The returned coordination system use xAxis, yAxis and zAxis to represent the uDir, vDir and normal.
The length of xAxis, yAxis represents the curvatures.
u: U component of parameter
v: V component of parameter
Returns: Coordinate system based on the normal, U direction, and V direction at the UV position on the surface

Autodesk.DesignScript.Geometry.Surface.CoordinateSystemAtParameter(System.Double,System.Double)
Return a CoordinateSystem aligned with principal curvature directions.
u: U component of parameter
v: V component of parameter
Returns: CoordinateSystem aligned with principal curvature directions

Autodesk.DesignScript.Geometry.Surface.TangentAtUParameter(System.Double,System.Double)
Return the U tangent Vector at specified U and V parameters.
u: U component of parameter
v: V component of parameter
Returns: U tangent vector

Autodesk.DesignScript.Geometry.Surface.TangentAtVParameter(System.Double,System.Double)
Return the V tangent Vector at specified U and V parameters.
u: U component of parameter
v: V component of parameter
Returns: V tangent vector

Autodesk.DesignScript.Geometry.Surface.NormalAtParameter(System.Double,System.Double)
Return the normal Vector at specified U and V parameters.
u: U component of parameter
v: V component of parameter
Returns: Normal at parameter

Autodesk.DesignScript.Geometry.Surface.DerivativesAtParameter(System.Double,System.Double)
Return the derivatives at input U and V coordinates.
u: U component of parameter
v: V component of parameter
Returns: U and V derivatives of surface
tangent,normal

Autodesk.DesignScript.Geometry.Surface.GaussianCurvatureAtParameter(System.Double,System.Double)
Returns the Gaussian curvature at U and V parameters.
developable

Autodesk.DesignScript.Geometry.Surface.PrincipalCurvaturesAtParameter(System.Double,System.Double)
Returns the principal curvatures at the U and V parameters.

Autodesk.DesignScript.Geometry.Surface.PrincipalDirectionsAtParameter(System.Double,System.Double)
Returns principal direction vectors at U and V parameters.
u: U component of parameter
v: V component of parameter
Returns: U and V tangent vectors

Autodesk.DesignScript.Geometry.Surface.PointAtParameter(System.Double,System.Double)
Return the Point at specified U and V parameters.
surfacepoint

Autodesk.DesignScript.Geometry.Surface.PerimeterCurves
Return all the boundary Curves of the Surface.
edges

Autodesk.DesignScript.Geometry.Surface.GetIsoline(System.Int32,System.Double)
Create a parameter line curve on the given surface.
Create a Curve that represents a u or v parameter line on the Surface. A
parameter line runs in the direction of increasing u or v parameter at a
constant opposite u or v parameter. The resulting Curve will match the
Surface parameterisation and its range will be bounded by the Surface
parameter range. The type of Curve returned will depend on the Surface
type.
isoDirection: If direction == 0, creates a U parameter line, if direction == 1, creates a V parameter line.
parameter:
lines
0.4

Autodesk.DesignScript.Geometry.Surface.FlipNormalDirection
Returns a new Surface with the Normal flipped. Leaves this surface
unchanged.
Returns: Surface, which is the same as the input surface but with flipped normals

Autodesk.DesignScript.Geometry.Surface.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Combines this Surface and input Surface into a PolySurface
topolysurface
Combines this Surface and input Surfaces into a PolySurface
join multiple,joinmany,joinall,topolysurface

Autodesk.DesignScript.Geometry.Surface.ProjectInputOnto(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projects the input Geometry onto this Surface in the input Vector direction.
!!This projection method currently supports only points or curves!!
projecttosurface,projectonto

Autodesk.DesignScript.Geometry.Surface.Repair
Attempts to repair the Surface.
Returns:

Autodesk.DesignScript.Geometry.Surface.ByUnion(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Surface})
Union a collection of surfaces into one surface.
This method might return a polySurface
if the resulting union is non-manifold or multi-faced.
surfaces: A collection of surfaces.
Returns: Union of surfaces
merge,join,boolean,addition

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Create a Surface by lofting between input cross section Curves.
loft
crossSections: Curves to loft through
Returns: Surface created by loft

Autodesk.DesignScript.Geometry.Surface.ByRuledLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Line})
Create a Surface by lofting between input cross section Lines.  This is slightly faster
and produces a less smooth result than Surface.ByLoft.
ruledsurface,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Surface.ByLoft(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Loft a Surface through the cross sections with a specified guide curves
(aka a rails). Guide curves must intersect all of the cross section
curves.
loftbyrails,loft rails,guides
crossSections: Curves to loft through
guideCurves: Curves to guide loft through
Returns: Surface created by loft

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Create a Surface by sweeping a profile Curve along a path.
profile:  Curve to sweep
path:  Path curve used to sweep along
Returns:  Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean)
Create a Surface by sweeping a profile Curve along a path.
profile: Curve to sweep
path: Path curve used to sweep along
cutEndOff: Cut the end of the sweep and make it normal to the path
Returns: Surface created by sweeping profile along path
sweep,rail,guide,sweep1

Autodesk.DesignScript.Geometry.Surface.ByPerimeterPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a Polygon Surface connecting input Points in a closed Polygon and
patching it.
points: List of perimeter points
Returns: Surface created from perimeter points
patch,surfacebypolygon

Autodesk.DesignScript.Geometry.Surface.BySweep2Rails(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Sweep the cross section curve along a path guided by a two rails
path: The input path to sweep along.
guideRail: A rail to guide the orientation of the sweep.
profile: The profile curve to sweep along the path.
Returns: Surface created by sweeping two rails
sweep2,guides

Autodesk.DesignScript.Geometry.Surface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double)
Create a Surface by sweeping the profile Curve around the axis ray formed
by origin Point in the direction of the axis Vector, starting
at start_angle in degrees, sweeping sweep_angle in degrees.
profile: Profile curve to revolve
axisOrigin: Revolving axis origin
axisDirection: Revolving axis direction
startAngle: Start angle in degrees
sweepAngle: Sweep angle in degrees
Returns: Surface created by revolving profile
lathe

Autodesk.DesignScript.Geometry.Surface.ByPatch(Autodesk.DesignScript.Geometry.Curve)
Create a Surface by filling in the interior of a closed boundary
defined by input Curves.
closedCurve: Closed curve used as surface boundary
Returns: Surface created by patch
edgesrf,edgesurface,patch,fill

Autodesk.DesignScript.Geometry.Surface.ToString
Get a string representation of the Surface