Autodesk.DesignScript.Geometry.IndexGroup.Count
Either 3 or 4, depending if it represents a triangle or a quad

Autodesk.DesignScript.Geometry.IndexGroup.A
The first index

Autodesk.DesignScript.Geometry.IndexGroup.B
The second index

Autodesk.DesignScript.Geometry.IndexGroup.C
The third index

Autodesk.DesignScript.Geometry.IndexGroup.D
The fourth index

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Create an IndexGroup storing four indices
a: Index a
b: Index b
c: Index c
d: Index d
Returns: IndexGroup
quad,polygon,mesh,meshes

Autodesk.DesignScript.Geometry.IndexGroup.ByIndices(System.UInt32,System.UInt32,System.UInt32)
Create an IndexGroup storing three indices
tri,polygon,mesh,meshes
a: Index a
b: Index b
c: Index c
Returns: IndexGroup

Autodesk.DesignScript.Geometry.IndexGroup.Equals(System.Object)
Compare two IndexGroup's
other: The other IndexGroup
Returns: Whether the two objects are equal

Autodesk.DesignScript.Geometry.IndexGroup.GetHashCode
Get a hashcode for this type
Returns:  A unique hashcode for this object

Autodesk.DesignScript.Geometry.IndexGroup.ToString
Get a string representation of the IndexGroup