Autodesk.DesignScript.Geometry.Arc.ByStartEndAndTangencies(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Create an arc or tangent bi arc by start and end points and tangencies at start and end

Autodesk.DesignScript.Geometry.Arc.CenterPoint
The center point of the arc
midpoint,arcs,arc

Autodesk.DesignScript.Geometry.Arc.Radius
Returns the radius of the arc.
arc,arcs

Autodesk.DesignScript.Geometry.Arc.StartAngle
Returns the start angle of the arc in degrees as the rotation from the X axis in the coordinate system around the Z-axis.
arc,arcs

Autodesk.DesignScript.Geometry.Arc.SweepAngle
Returns the sweep angle of the arc in degrees.
arc,arcs

Autodesk.DesignScript.Geometry.Arc.ByThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create an arc by providing three sequential points along its circumference.
firstPoint: 1st point of arc
secondPoint: 2nd point of arc
thirdPoint: 3rd point of arc
Returns: Arc created from three points
arc,arcs

Autodesk.DesignScript.Geometry.Arc.ByCenterPointRadiusAngle(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,Autodesk.DesignScript.Geometry.Vector)
Create an arc by providing it's center point, radius, angle sweep, and normal vector
center: Center point of arc
radius: Radius of the arc
startAngle: Start angle in degrees
endAngle: End angle in degrees
normal: A vector defining the normal of the arc
Returns: Arc created by center point, radius, and angle
arc,center,arcs

Autodesk.DesignScript.Geometry.Arc.ByCenterPointStartPointSweepAngle(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,Autodesk.DesignScript.Geometry.Vector)
Create an arc by providing it's center point, start point, sweep point, and normal
centerPoint: Center point of arc
startPoint: Start point of arc
sweepAngle: Angle to sweep out
normal: Normal direction vector of arc
Returns: Arc created by center point, start point, and sweep angle
arc,center,arcs

Autodesk.DesignScript.Geometry.Arc.ByCenterPointStartPointEndPoint(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Create an arc by providing it's center point, start point, and end point
centerPoint: Center point of arc
startPoint: Start point of arc
endPoint: End point of arc
Returns: Arc created with center point, start point, and end point
arc,center,arcs

Autodesk.DesignScript.Geometry.Arc.ByFillet(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Double)
Create an arc by filleting two curves with given radius
curve1: First curve
curve2: Second curve
radius: The radius of the fillet arc
Returns: Arc from fillet
arc,fillet,round,smooth,arcs

Autodesk.DesignScript.Geometry.Arc.ByFilletTangentToCurve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve)
Create an arc by filleting two curves tangent to given curve at internal point
curve1: First curve
curveTangentTo: Curve to which the fillet arc is tangent at internal point
curve2: Second curve
Returns: Arc from fillet tangent to curve
arc,fillet,round,smooth

Autodesk.DesignScript.Geometry.Arc.ByBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create an arc that best approximates a collection of points
points: List of points to best fit arc to
Returns: Arc created by best fit through points
arc,approximate,arcs

Autodesk.DesignScript.Geometry.Arc.ByStartPointEndPointStartTangent(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Create an Arc from start Point to end Point with start tangent to Vector
startPoint: Start point of arc
endPoint: End point of arc
startTangent: Start tangent direction vector
Arc created from start, end point, and tangent
arc,tangent,arcs

Autodesk.DesignScript.Geometry.Arc.ToString
Get a string representation of the Arc