Autodesk.DesignScript.Geometry.CoordinateSystem.ByMatrix(System.Double[])
Create a CoordinateSystem from a 4x4 matrix. This method is deprecated; prefer other constructors where possible.
matrix: 4x4 transformation matrix
Returns: CoordinateSystem from the matrix

Autodesk.DesignScript.Geometry.CoordinateSystem.FromJson(System.String)
Parse the incoming JSON string formatted with autodesk.math:matrix44d-1.0.0 schema.
json: JSON string to parse
Returns: CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.ToJson
Convert the CoordinateSystem into a JSON object formatted with autodesk.math:matrix44d-1.0.0 schema.
Returns: The resulting JSON string

Autodesk.DesignScript.Geometry.CoordinateSystem.IsSingular
Determine whether it is possible to get the Inverse of this CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.IsScaledOrtho
Tests if the scaling orthogonal, i.e. does it have a shear component.

Autodesk.DesignScript.Geometry.CoordinateSystem.IsUniscaledOrtho
Tests if the scaling orthogonal and are all the vectors normalized.

Autodesk.DesignScript.Geometry.CoordinateSystem.Determinant
Obtain the Determinant of this CoordinateSystem

Autodesk.DesignScript.Geometry.CoordinateSystem.Origin
Creates a Point representing the CoordinateSystem origin.

Autodesk.DesignScript.Geometry.CoordinateSystem.XAxis
Returns X Axis of CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.YAxis
Returns Y Axis of CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZAxis
Returns Z Axis of CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.XScaleFactor
Returns the length of the X axis vector from the coordinate system.

Autodesk.DesignScript.Geometry.CoordinateSystem.YScaleFactor
Returns the length of the Y axis vector from the coordinate system.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZScaleFactor
Returns the length of the Z axis vector from the coordinate system.

Autodesk.DesignScript.Geometry.CoordinateSystem.XYPlane
Returns the Plane the X and Y axes lie in, with root at the origin.

Autodesk.DesignScript.Geometry.CoordinateSystem.YZPlane
Returns the Plane the Y and Z axes lie in, with root at the origin.

Autodesk.DesignScript.Geometry.CoordinateSystem.ZXPlane
Returns the Plane the Z and X axes lie in, with root at the origin.

Autodesk.DesignScript.Geometry.CoordinateSystem.Inverse
Get the inverse of this CoordinateSystem - applying this CoordinateSystem to a piece of Geometry reverses the original.
Returns: Returns inverted coordinate system from the input

Autodesk.DesignScript.Geometry.CoordinateSystem.PostMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Apply the argument CoordinateSystem after this one - Result = this * other.
other: Other coordinate system
Returns: New coordinate system from multiplication

Autodesk.DesignScript.Geometry.CoordinateSystem.PreMultiplyBy(Autodesk.DesignScript.Geometry.CoordinateSystem)
Apply the argument CoordinateSystem before this one - Result = other * this.
other: Other coordinate system
Returns: New coordinate system from multiplication

Autodesk.DesignScript.Geometry.CoordinateSystem.ScaleFactor
Returns a Vector containing the X, Y, and Z scale factors

Autodesk.DesignScript.Geometry.CoordinateSystem.IsEqualTo(Autodesk.DesignScript.Geometry.CoordinateSystem)
Determine if two CoordinateSystems are equal

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(System.Double,System.Double,System.Double)
Translates any given geometry by the given displacements in the x, y,
and z directions defined in WCS respectively.
xTranslation: Displacement along X-axis.
yTranslation: Displacement along Y-axis.
zTranslation: Displacement along Z-axis.
Returns: Transformed Geometry.
move,by amount

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector)
Translate the object in the direction and magnitude of input Vector.
move,along vector,movebyvector

Autodesk.DesignScript.Geometry.CoordinateSystem.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Translates any geometry type by the given distance in the given
direction.
direction: Displacement direction.
distance: Displacement distance along given direction.
Returns: Transformed Geometry.
move,along vector,distance

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transform the object by the input CoordinateSystem matrix.
coordinateSystem: input coordinate system
Returns: Transformed coordinate system

Autodesk.DesignScript.Geometry.CoordinateSystem.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Returns this geometry with its position expressed relative to the
targetCoordinateSystem, placed into the frame of the sourceCoordinateSystem.
The local position of the result within the sourceCoordinateSystem
matches the local position of the input within the targetCoordinateSystem.
To obtain the coordinates of a geometry in world-space within a given coordinate
system, pass CoordinateSystem.Identity as the sourceCoordinateSystem
and the given CS as the targetCoordinateSystem.
The resulting geometry coordinates will equal the coordinates of the input
relative to that target frame.
targetCoordinateSystem:
The CoordinateSystem to express the geometry relative to.
sourceCoordinateSystem:
The CoordinateSystem the geometry is currently expressed in.
Pass CoordinateSystem.Identity() to work in world space.
Returns: Transformed Geometry.
from,to, local coordinates

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotates an object around an origin and an axis by a specified
degree
around,axis,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates an object around the Plane origin and normal by a specified
degree
basePlane: Reference Plane to rotate around
degrees: Rotation angle in degrees
around,normal,degrees

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double)
Scale uniformly around the origin
resize,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(System.Double,System.Double,System.Double)
Scale non-uniformly around the origin
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Scale non-uniformly around a given Plane
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale uniformly around a given point,  using two pick points as scalars
resize,from,to,size

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale non-uniformly in one dimension by base and 2 pick points.  The scaling axis is defined by the line between base and from point.
resize,size,from,to,scale1d,1d

Autodesk.DesignScript.Geometry.CoordinateSystem.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in two dimensions by base and 2 pick points  The two pick points are projected onto the base plane in order to determine the 2d scale factors
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.CoordinateSystem.Mirror(Autodesk.DesignScript.Geometry.Plane)
Mirror the object across the input Plane
reflect,flip over

Autodesk.DesignScript.Geometry.CoordinateSystem.Identity
Creates a CoordinateSystem as the World Coordinate System: origin at
0, 0, 0; x axis at 1, 0, 0; y axis at 0, 1, 0; z axis at 0, 0, 1
zero,wcs

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(System.Double,System.Double)
Create a CoordinateSystem with origin at X and Y locations, with
X and Y Axes set as WCS X and Y Axes. Z defaults to 0.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(System.Double,System.Double,System.Double)
Create a CoordinateSystem with origin at X, Y, and Z locations, with
X and Y Axes set as WCS X and Y Axes.
translate

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOrigin(Autodesk.DesignScript.Geometry.Point)
Create a CoordinateSystem with origin at input Point, with X and Y Axes
set as WCS X and Y Axes.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByPlane(Autodesk.DesignScript.Geometry.Plane)
Create a CoordinateSystem with origin equal to input Plane origin, and
X and Y axes lying in the Plane, aligned with Plane X and Y axes.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create a CoordinateSystem at the origin with X and Y axis.
Input Vectors are normalized before creating the CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByOriginVectors(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Create a CoordinateSystem at the origin with X and Y axis, with Z
axis ignored completely. Input Vectors are normalized before creating
the CoordinateSystem.

Autodesk.DesignScript.Geometry.CoordinateSystem.ByCylindricalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Creates a CoordinateSystem at the specified cylindrical coordinate parameters with respect to the specified coordinate system.

Autodesk.DesignScript.Geometry.CoordinateSystem.BySphericalCoordinates(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Creates a CoordinateSystem at the specified spherical coordinate parameters with respect to the specified coordinate system.

Autodesk.DesignScript.Geometry.CoordinateSystem.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compare two CoordinateSystem's
other: The other CoordinateSystem
Returns: Whether the two objects are equal

Autodesk.DesignScript.Geometry.CoordinateSystem.ComputeHashCode
Get a hashcode for this type
Returns:  A unique hashcode for this object

Autodesk.DesignScript.Geometry.CoordinateSystem.ToString
Get a string representation of the CoordinateSystem