Autodesk.DesignScript.Geometry.Sphere.CenterPoint
Return the center Point of the Sphere.

Autodesk.DesignScript.Geometry.Sphere.Radius
Return the radius of the Sphere.

Autodesk.DesignScript.Geometry.Sphere.ByCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double)
Create a Solid Sphere cetered at the input Point, with given radius.
Brep,brep

Autodesk.DesignScript.Geometry.Sphere.ByFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a Solid Sphere containing four input Points on the surface.
Brep,brep

Autodesk.DesignScript.Geometry.Sphere.ByBestFit(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Fit a Sphere as close as possible to the input Points.
Brep,brep

Autodesk.DesignScript.Geometry.Sphere.ToString
Get a string representation of the Sphere