ProtoGeometryGenerator.GenerateShadowingAttribute
Properties and methods implemented by the generator using the ProtoGeometryGenerator.GenerateFromInterfaceAttribute can
be overriden. This attribute will prevent the generation of a method named overrideName
whose params exactly matches the parameterTypes array.
Some of the methods in the library don't match the generated output exactly, meaning the generator can't see
them as overrides. This attribute lets a method take the place of another method, by explicitly shadowing
what the generator would have implemented.
Several [class]es implement a static FromJson method that takes a single string, where
the factory interface has a method [class]FromJson that takes string and double.
This attribute lets the single string version override the automatic one.

ProtoGeometryGenerator.GenerateShadowingAttribute.#ctor(System.String,System.Type[])
Properties and methods implemented by the generator using the ProtoGeometryGenerator.GenerateFromInterfaceAttribute can
be overriden. This attribute will prevent the generation of a method named overrideName
whose params exactly matches the parameterTypes array.
Some of the methods in the library don't match the generated output exactly, meaning the generator can't see
them as overrides. This attribute lets a method take the place of another method, by explicitly shadowing
what the generator would have implemented.
Several [class]es implement a static FromJson method that takes a single string, where
the factory interface has a method [class]FromJson that takes string and double.
This attribute lets the single string version override the automatic one.