Autodesk.DesignScript.Geometry.Curve.Length
Returns the total arc length of the curve
distance

Autodesk.DesignScript.Geometry.Curve.IsPlanar
Returns True if a curve is planar, False otherwise.
flat,liesinplane

Autodesk.DesignScript.Geometry.Curve.IsClosed
Returns True if a curve is closed, False otherwise.

Autodesk.DesignScript.Geometry.Curve.StartPoint
Get the start Point along the Curve
begin,curvestart,startpt

Autodesk.DesignScript.Geometry.Curve.EndPoint
Get the end Point along the Curve
end,curveend,endpt

Autodesk.DesignScript.Geometry.Curve.Normal
The normal to the plane the curve lies in. Only valid for planar curves.
perpendicular

Autodesk.DesignScript.Geometry.Curve.PointAtParameter(System.Double)
Get a Point on the Curve at a specified parameter between StartParameter() and EndParameter()
param: The parameter at which to evaluate
Returns: Point
pointoncurve,curvepoint

Autodesk.DesignScript.Geometry.Curve.TangentAtParameter(System.Double)
Get a Vector tangent to the curve at a specified parameter between StartParameter() and EndParameter()
param: The parameter at which to evaluate
Returns: A Vector parallel to the curve at param
tangentoncurve,curvetan

Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double)
Get a Vector perpendicular to the curve at a specified parameter between StartParameter() and EndParameter()
param: The parameter at which to evaluate
Returns: A Vector perpendicular to the curve at param
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Get a Vector perpendicular to the curve at a specified parameter between StartParameter() and EndParameter()
The curve must be planar. The resulting normal will be consistent across the entire curvature of the curve.
param: The parameter at which to evaluate
side: If 'side' is set to false, the normal will point to the right side of the curve (moving from the startpoint to the endpoint of the curve). If 'side' is true, the normal will point to the left of the curve.
Returns: A Vector perpendicular to the curve at param
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtParameter(System.Double)
Get a CoordinateSystem with origin at the point at the given parameter. The XAxis is aligned with the curve normal,
the YAxis is aligned with the curve tangent at this point, and the ZAxis is aligned with the up-vector or binormal at this point
param: The parameter at which to evaluate
Returns: CoordinateSystem at parameter of curve
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.HorizontalFrameAtParameter(System.Double)
Get a CoordinateSystem with origin at the point at the given parameter
param: The parameter at which to evaluate
Returns: The axis-aligned CoordinateSystem at the point
frame,axisaligned,aa,coordcurve,framecurve,curveframe,coordoncurve

Autodesk.DesignScript.Geometry.Curve.PlaneAtParameter(System.Double)
Returns a Plane whose normal aligns with the tangent of the Curve.
Parameters are adjusted such that 0 is always the start Point
and 1 is always the end Point.
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.PointAtSegmentLength(System.Double)
Get a Point at a particular arc length along the curve
segmentLength: The distance along the curve at which to evaluate
Returns: The point at the given arc length
pointoncurve,curvepoint,pointalongcurve,distanceoncurve,distancepoint,distpoint,arclength

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualSegmentLength(System.Int32)
Returns points spaced equally along the curve length
based on the input number of divisions
divisions: Number of divisions
Returns: Points spaced equally along length of curve

Autodesk.DesignScript.Geometry.Curve.PointsAtEqualChordLength(System.Int32)
Returns points spaced along curve at equal chord length
based on the input number of divisions
divisions: Number of divisions
Returns: List of points on curve

Autodesk.DesignScript.Geometry.Curve.PointAtChordLength(System.Double,System.Double,System.Boolean)
Get the point at a particular chord length of the curve from given parameter location.
chordLength: The chord length at which to evaluate
parameterLocation: Parameter on the curve to measure from
forward: true if move forward along curve
Returns: Point on curve
measure from,measure to,parameteratdist

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Returns points spaced equally along the curve at given segment length
from the given point
point: The reference point from where to measure
segmentLength: The distance along the curve at which to evaluate
Returns: List of points on curve including the given point and along the direction of the curve.

Autodesk.DesignScript.Geometry.Curve.PointsAtChordLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Returns points spaced equally on the curve at given chord length from the given point
point: The reference point from where to measure
chordLength: Chord length
Returns: List of points on curve including the given point and along the direction of the curve.

Autodesk.DesignScript.Geometry.Curve.CoordinateSystemAtSegmentLength(System.Double)
Returns a CoordinateSystem at specified distance from Curve start Point.
Y Axis lies tangent to the Curve, X Axis is the curvature.
segmentLength: The distance along the curve at which to evaluate
Returns: CoordinateSystem on curve
coordoncurve,curvecoord,derivatives

Autodesk.DesignScript.Geometry.Curve.PlaneAtSegmentLength(System.Double)
Returns a Plane at the specified distance along the Curve from the
start Point. The normal of the Plane aligns with the tangent of the
Curve.
segmentLength: The distance along the curve at which to evaluate
Returns: Plane on curve
planeoncurve,planecurve,tangentplane

Autodesk.DesignScript.Geometry.Curve.SegmentLengthAtParameter(System.Double)
Get the segment length measured from the start point of the curve to the given parameter.
parameter: Value between 0-1
Returns: Segment length
lengthatparameter,dist along,lengthatpoint,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtSegmentLength(System.Double)
Get the parameter at a particular arc length along the curve.
segmentLength: The distance along the curve at which to evaluate
Returns: The parameter
parameteratlen,param along,paramatlen,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtChordLength(System.Double,System.Double,System.Boolean)
Get the parameter at a particular chord length along the curve from given location.
chordLength: The chord length at which to evaluate
parameter: Parameter on the curve to measure from
forward: true if move forward along curve
Returns: The parameter
measure from,measure to,parameteratdist

Autodesk.DesignScript.Geometry.Curve.StartParameter
Get the parameter at the start point of a curve
Returns: Parameter value
start domain,curvestart

Autodesk.DesignScript.Geometry.Curve.EndParameter
Get the parameter at the end point of a curve
Returns: Parameter value
end domain,curveend

Autodesk.DesignScript.Geometry.Curve.SegmentLengthBetweenParameters(System.Double,System.Double)
Get the segment length between two parameters on the curve
startParam: Value between 0-1
endParam: Value between 0-1
Returns: Segment length
measure,distance,arclength

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Get the parameter at a given point along the curve. If the point is not on the curve then ParameterAtPoint will still return a value
which will correspond to a nearby point on the curve, but the point is not in general the closest point.
point: A point along or near the curve
Returns: The parameter on the curve for the given point.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.Reverse
Reverse the direction of the curve
Returns: A new Curve with the opposite direction
flip

Autodesk.DesignScript.Geometry.Curve.TrimByStartParameter(System.Double)
Removes the start of the Curve at the specified parameter
startParameter: The parameter at which to start the trim
Returns: A new Curve with the start removed
rem,remstart,removestart,trimcurve

Autodesk.DesignScript.Geometry.Curve.TrimByEndParameter(System.Double)
Removes the end of the Curve at the specified parameter
endParameter: The parameter at which to start the trim
Returns: A new Curve with the end removed
rem,remend,removeend,trimcurve

Autodesk.DesignScript.Geometry.Curve.TrimByParameter(System.Double,System.Double)
Removes the beginning and end of the Curve at the specified parameters.
startParameter: The parameter at which to start the trim
endParameter: The parameter at which to start the trim
Returns: A new Curve with the outer segments removed
rem,remend,remstart,remove,trimcurve,removeends

Autodesk.DesignScript.Geometry.Curve.TrimInteriorByParameter(System.Double,System.Double)
Removes the interior portion of a Curve at the specified parameters
startParameter: The parameter at which to start the trim
endParameter: The parameter at which to start the trim
Returns: A new Curve with the interior segment removed
rem,removemiddle,middle,remmiddle,cutout,trimcurve

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[],System.Boolean)
Removes even or odd segments of the Curve split at the given parameters depending on whether the 'discardEvenSegments' flag is true or false respectively.
parameters: A list of parameters at which to split the curve
discardEvenSegments: Toggle to discard even segments
Returns: List of curves remaining after discarding the even or odd curve segments.
rem,removeparts,remparts,cutout,trimcurv,interior,even

Autodesk.DesignScript.Geometry.Curve.SplitByParameter(System.Double[])
Split a Curve into multiple pieces at the given parameters
parameters: A list of parameters at which to split the curve
Returns: Curves created from splitting
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.SplitByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Split a Curve into multiple pieces at the given points
points: The points on the curve at which to split the curve
Returns: Curves created from splitting
cutinto,divide,curve2curves,cut,cut multiple,splitmultiple

Autodesk.DesignScript.Geometry.Curve.Join(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve})
Join set of curves to the end of the polycurve. Flips curves to assure connectivity.
curves: Other curves or curve to join to polycurve
Returns: A Polycurve made from curves
convertcurves,curves2polycurve,joincurves,concat,joinall,joinmany

Autodesk.DesignScript.Geometry.Curve.Extend(System.Double,Autodesk.DesignScript.Geometry.Point)
Extend a Curve by a given distance at a particular end determined by a pick Point.  The picked side will be extended.  Closed curves like Circles and Ellipses cannot be extended. If the curve being extended is linear, the extension will also be linear.
distance: Distance to extend
pickSide: A Point on the end to extend
Returns: The extended Curve
makelonger,stretch,extendside

Autodesk.DesignScript.Geometry.Curve.ExtendStart(System.Double)
Extend a Curve by a given distance on its start side.  Closed curves like Circles and Ellipses cannot be extended. If the curve being extended is linear, the extension will also be linear.
distance: Distance to extend
Returns: The extended Curve
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ExtendEnd(System.Double)
Extend a Curve by a given distance on its end.  Closed curves like Circles and Ellipses cannot be extended. If the curve being extended is linear, the extension will also be linear.
distance: Distance to extend
Returns: The extended Curve
makelonger,stretch

Autodesk.DesignScript.Geometry.Curve.ApproximateWithArcAndLineSegments
Approximate a Curve with a collection of Arcs and Lines
Returns: An Array of Arcs and Lines approximating the curve
rationalizecurve,fitarcs,fitlines,arcs,lines
0.5,0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.Simplify(System.Double)
Returns a new Curve approximated with the supplied tolerance
fitcurve,reducecurve,simplecurve,approximate

Autodesk.DesignScript.Geometry.Curve.Offset(System.Double)
Offset a Curve by a specified amount. Curve must be planar.
distance: A positive or negative distance to offset
Returns: new offset curves
thicken,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Create one or more curves by offsetting a planar curve by the given distance in a plane defined by the plane normal. If there are gaps between the offset component curves then, they are filled by extending the offset curves.
The "planeNormal" input argument defaults to the normal of the plane containing the curve but an explicit normal parallel to the original curve normal can be provided to better control the direction of the offset.
For example, if a consistent offset direction is required for multiple curves sharing the same plane, the "planeNormal" can be used to override individual curve normals and force all curves to be offset in the same direction.
Reversing the normal reverses the direction of the offset.
signedDistance: A positive offset distance applies in the direction of the cross product between the curve's tangent and the plane's normal vector, while a negative offset applies in the opposite direction.
planeNormal:  The curve's plane normal. Defaults to the input curve's plane normal
Returns: One or more offset curves
thicken,lines
0.5,0.4

Autodesk.DesignScript.Geometry.Curve.PullOntoPlane(Autodesk.DesignScript.Geometry.Plane)
Create a curve by pulling onto plane
plane: The plane on which to pull the curve
Returns: A Curve on the Plane
projectcurve,toplane

Autodesk.DesignScript.Geometry.Curve.PullOntoSurface(Autodesk.DesignScript.Geometry.Surface)
Pull this Curve onto the input Surface, in the direction of the Surface normals.
projectcurve,tosurf

Autodesk.DesignScript.Geometry.Curve.TrimSegmentsByParameter(System.Double[])
Removes several segments of the curve, discarding the 1st, 3rd, 5th ... segments
parameters: A list of parameters at which to split the curve
Returns: An Array of curves discarding the 1st, 3rd, 5th ... segments
rem,removeparts,remparts,cutout,trimcurv,interior,odd

Autodesk.DesignScript.Geometry.Curve.Extrude(System.Double)
Extrudes a Curve in the normal Vector direction
distance: The distance to extrude the curve
Returns: The extruded Surface
pushcurve,pullcurve,curve2surf,curveextrude,extrudecurve

Autodesk.DesignScript.Geometry.Curve.Extrude(Autodesk.DesignScript.Geometry.Vector)
Extrudes a Curve in the specified direction, by the length of the input Vector
direction: Vector to extrude along
Returns: The extruded Surface
pushcurve,pullcurve,curve2surf,curveextrude,extrudecurve

Autodesk.DesignScript.Geometry.Curve.Extrude(Autodesk.DesignScript.Geometry.Vector,System.Double)
Extrudes a Curve in the specified direction, by the specified distance
direction: Vector to extrude along
distance: Distance to extrude
Returns: The extruded Surface
pushcurve,pullcurve,curve2surf,curveextrude,extrudecurve

Autodesk.DesignScript.Geometry.Curve.ExtrudeAsSolid(System.Double)
Extrudes a Curve in the Normal direction by the specified distance. Curve must be closed.
distance: Distance to extrude
Returns: The extruded Solid
profileextrude,extrudeprofile,curve2solid,curveextrude,extrudecurve

Autodesk.DesignScript.Geometry.Curve.ExtrudeAsSolid(Autodesk.DesignScript.Geometry.Vector)
Extrudes a Curve in the specified direction, by the length of the input Vector. Curve must be closed.
direction: Vector to extrude along
Returns: The extruded Solid
profileextrude,extrudeprofile,curve2solid,curveextrude,extrudecurve

Autodesk.DesignScript.Geometry.Curve.ExtrudeAsSolid(Autodesk.DesignScript.Geometry.Vector,System.Double)
Extrudes a Curve in the specified direction, by the specified distance. Curve must be closed.
direction: Vector to extrude along
distance: Distance to extrude
Returns: The extruded Solid
profileextrude,extrudeprofile,curve2solid,curveextrude,extrudecurve

Autodesk.DesignScript.Geometry.Curve.ToNurbsCurve
Converts the Curve to a NurbsCurve approximation
Returns: A NurbsCurve approximating the Curve
curve2spline,convertcurve,tospline,lines
0.5,0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.Patch
Patch a closed Curve
Returns: A Surface on the interior of the curve
fill,profiletosurf,loop,loop2surf,edgesurf

Autodesk.DesignScript.Geometry.Curve.Project(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Vector)
Projects an input curve along a given projection direction onto a specified base geometry.
baseGeometry: Geometry to project onto
projectionDirection: Vector
Returns: List of geometries projected into base geometry

Autodesk.DesignScript.Geometry.Curve.SweepAsSurface(Autodesk.DesignScript.Geometry.Curve)
Sweeps this Curve along the path Curve, creating a Surface
sweep1,curve2surf

Autodesk.DesignScript.Geometry.Curve.SweepAsSurface(Autodesk.DesignScript.Geometry.Curve,System.Boolean)
Sweeps this Curve along the path Curve, creating a Surface
path: The path that represent the sweep path
cutEndOff: Cut the end of the sweep and make it normal to the path
Returns: A Surface resulting from sweeping the curve along the path
sweep1,curve2surf

Autodesk.DesignScript.Geometry.Curve.SweepAsSolid(Autodesk.DesignScript.Geometry.Curve)
Sweeps this closed Curve along the path Curve, creating a Solid
sweep1,curve2solid,loop2solid,profile2solid,curvetosolid,looptosolid,profiletosolid

Autodesk.DesignScript.Geometry.Curve.SweepAsSolid(Autodesk.DesignScript.Geometry.Curve,System.Boolean)
Sweeps this closed Curve along the path Curve, creating a Solid
path: The path that represent the sweep path
cutEndOff: Cut the end of the sweep and make it normal to the path
Returns: A solid that sweeps this closed Curve along the path Curve
sweep1,curve2solid,loop2solid,profile2solid,curvetosolid,looptosolid,profiletosolid

Autodesk.DesignScript.Geometry.Curve.ByParameterLineOnSurface(Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.UV,Autodesk.DesignScript.Geometry.UV)
Create a curve by line of surface in uv space
baseSurface:  Surface to use
startParams:  Starting uv at which curve will start
endParams:  Ending uv at which curve will end
Returns: Curve at start and end parameters of surface
isocurve,curvebyuv,lines,uvs
0.5,0.5,0.4,0.4

Autodesk.DesignScript.Geometry.Curve.ByBlendBetweenCurves(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean)
Create a curve that blends between two curves
curve1:  First curve to blend
curve2:  Second curve to blend
endOrStart1:  flag to indicate which end of curve 1 to blend
endOrStart2:  flag to indicate which end of curve 2 to blend
isG2Continuous:  flag to indicate if resultant curve is of G1 continuity or G2 continuity
Returns: Resulting curve from blending two curves
blend,make continuous,connect

Autodesk.DesignScript.Geometry.Curve.ByIsoCurveOnSurface(Autodesk.DesignScript.Geometry.Surface,System.Int32,System.Double)
Create a curve by isoline of surface
baseSurface:  Base surface
direction:  if 0 isoline is along u direction, if 1 along v direction
parameter:  fixed for the curve value of other surface parameter
Returns: Isocurve on surface
isocurve,curvebydir,lines
0.5,0.5,0.4

Autodesk.DesignScript.Geometry.Curve.ToString
Get a string representation of the Curve