Autodesk.DesignScript.Geometry.GeometrySettings.RootModulePath
Provides path of the root script in execution.

Autodesk.DesignScript.Geometry.GeometrySettings.Reset
Resets the geometry settings to default