Autodesk.DesignScript.Geometry.Vector.FromJson(System.String)
Parse the incoming JSON string formatted with autodesk.math:vector3d-1.0.0 schema.
json: JSON string to parse
Returns: Vector

Autodesk.DesignScript.Geometry.Vector.ToJson
Convert the Vector into a JSON object formatted with autodesk.math:vector3d-1.0.0 schema.
Returns: The resulting JSON string

Autodesk.DesignScript.Geometry.Vector.X
Get the X value of a vector.

Autodesk.DesignScript.Geometry.Vector.Y
Get the Y value of a vector.

Autodesk.DesignScript.Geometry.Vector.Z
Get the Z value of a vector.

Autodesk.DesignScript.Geometry.Vector.Length
Get the length of the vector otherwise known as the Euclidean norm.
magnitude

Autodesk.DesignScript.Geometry.Vector.AsPoint
Get the Point with the same X, Y, and Z component
convertopoint,vector2point

Autodesk.DesignScript.Geometry.Vector.Reverse
Get the reverse of the vector.  Essentially this negates the X, Y, and Z components of the Vector.
backwards,vectorflip

Autodesk.DesignScript.Geometry.Vector.Add(Autodesk.DesignScript.Geometry.Vector)
Add a vector
sum,sumvectors

Autodesk.DesignScript.Geometry.Vector.Subtract(Autodesk.DesignScript.Geometry.Vector)
Subtract a vector
substact,diff vectors,between

Autodesk.DesignScript.Geometry.Vector.Cross(Autodesk.DesignScript.Geometry.Vector)
Form the cross product of two vectors
perpendicular

Autodesk.DesignScript.Geometry.Vector.Dot(Autodesk.DesignScript.Geometry.Vector)
Form the dot product of two vectors
project,projectvector,vectorproject,onto

Autodesk.DesignScript.Geometry.Vector.Normalized
Get the normalized version of a vector

Autodesk.DesignScript.Geometry.Vector.IsParallel(Autodesk.DesignScript.Geometry.Vector)
Determine whether two vectors are parallel.
Returns: Returns True if the vectors are parallel; false otherwise.
otherVector: Other vector

Autodesk.DesignScript.Geometry.Vector.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Vector)
Determine whether two vectors are almost equal. A tolerance value of 1e-5 is used.
Returns: Returns True if the vectors are almost equal; false otherwise.
otherVector: Other vector
vector approximate,near,same

Autodesk.DesignScript.Geometry.Vector.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transform this Vector by input CoordinateSystem matrix.

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotates a Vector around an axis by a specified number of
degrees
around,axis,degrees

Autodesk.DesignScript.Geometry.Vector.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates a vector around the Plane origin and normal by a specified
degree
around,normal,degrees

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double)
Scale Vector uniformly around the origin
resize,size

Autodesk.DesignScript.Geometry.Vector.Scale(System.Double,System.Double,System.Double)
Scale Vector non-uniformly around the origin
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.Vector.AngleWithVector(Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two vectors in degrees from 0 to 180.
otherVector: Other vector
Returns: Returns angle between the supplied vectors in degrees from 0 to 180.
rotation angle,

Autodesk.DesignScript.Geometry.Vector.AngleAboutAxis(Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns the angle between the two vectors in degrees from 0 to 360.
It uses axis of rotation to determine the direction of the angle.
otherVector: Other vector
rotationAxis: Axis of rotation
Returns: Returns Angle between the supplied vectors in degrees from 0 to 360
rotation angle,

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double)
Form a Vector by 3 Euclidean coordinates
x: X coordinate
y: Y coordinate
z: Z coordinate
Returns:
vector,xyz,vector3

Autodesk.DesignScript.Geometry.Vector.ByCoordinates(System.Double,System.Double,System.Double,System.Boolean)
Form a Vector by 3 Euclidean coordinates and normalize the Vector
x: X coordinate
y: Y coordinate
z: Z coordinate
normalized: Whether to normalize the result Vector or not
Returns:
normalize,vector3

Autodesk.DesignScript.Geometry.Vector.ByTwoPoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Form a Vector by two end points.  The result is a vector from the start to the end point.
start: Start point of vector
end: End point of vector
Returns: Vector created from two points
vector2

Autodesk.DesignScript.Geometry.Vector.XAxis
Get the canonical X axis Vector (1,0,0)
Returns: Canonical X axis vector (1,0,0)
x, basis,right

Autodesk.DesignScript.Geometry.Vector.YAxis
Get the canonical Y axis Vector (0,1,0)
Returns: Canonical Y axis vector (0,1,0)
y, basis,forward

Autodesk.DesignScript.Geometry.Vector.ZAxis
Get the canonical Z axis Vector (0,0,1)
Returns: Canonical Z axis vector (0,0,1)
z, basis,up

Autodesk.DesignScript.Geometry.Vector.Equals(Autodesk.DesignScript.Geometry.DesignScriptEntity)
Compare two Vector's
other: The other Vector
Returns: Whether the two objects are equal

Autodesk.DesignScript.Geometry.Vector.ComputeHashCode
Get a hashcode for this type
Returns:  A unique hashcode for this object

Autodesk.DesignScript.Geometry.Vector.ToString
Get a string representation of the Vector