Autodesk.DesignScript.Geometry.Geometry.mGeometryContructors
A map between IGeometryEntity types and Geometry constructors using host.

Autodesk.DesignScript.Geometry.Geometry.RegisterHostType(System.Type,System.Func{Autodesk.DesignScript.Interfaces.IGeometryEntity,Autodesk.DesignScript.Geometry.Geometry})
Geometry Type registration mechanism.
hostType: Type of IGeometryEntity derived interfaces.
contructor: A delegate to construct Geometry.

Autodesk.DesignScript.Geometry.Geometry.Dispose(System.Boolean)
disposing:

Autodesk.DesignScript.Geometry.Geometry.BoundingBox
Get the BoundingBox containing the given piece of Geometry

Autodesk.DesignScript.Geometry.Geometry.OrientedBoundingBox
Gets the minimum-volume, oriented bounding box containing the given geometry.

Autodesk.DesignScript.Geometry.Geometry.SetAttributes(System.Collections.Generic.Dictionary{System.String,System.String})
Sets name-value attributes as strings on the input geometry.
The attributes are saved along with the geometry when it is exported to a SAT file
and can be read back when importing the geometry from the file.
Note: The attributes are not guaranteed to be retained on the geometry if it
undergoes any geometric operations.
attributes: Dictionary of name-value string attributes.
Returns: Returns a copy of the input geometry with attributes applied to it.

Autodesk.DesignScript.Geometry.Geometry.GetAttributes
Returns the name-value string attributes set on the input geometry if any.
Returns: Dictionary of name-value string attributes.

Autodesk.DesignScript.Geometry.Geometry.ToJson
Convert the Geometry into a JSON object formatted with autodesk.geometry:geometry-1.0.0 schemata.
Returns: The resulting JSON string

Autodesk.DesignScript.Geometry.Geometry.Translate(System.Double,System.Double,System.Double)
Translates any given geometry by the given displacements in the x, y,
and z directions defined in WCS respectively.
xTranslation: Displacement along X-axis.
yTranslation: Displacement along Y-axis.
zTranslation: Displacement along Z-axis.
Returns: Transformed Geometry.
move,by amount

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector)
Translate the object in the direction and magnitude of input Vector.
move,along vector,movebyvector

Autodesk.DesignScript.Geometry.Geometry.Translate(Autodesk.DesignScript.Geometry.Vector,System.Double)
Translates any geometry type by the given distance in the given
direction.
direction: Displacement direction.
distance: Displacement distance along given direction.
Returns: Transformed Geometry.
move,along vector,distance

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem)
Transform the object by the input CoordinateSystem matrix.
coordinateSystem: input coordinate system
Returns: Transformed coordinate system

Autodesk.DesignScript.Geometry.Geometry.Transform(Autodesk.DesignScript.Geometry.CoordinateSystem,Autodesk.DesignScript.Geometry.CoordinateSystem)
Returns this geometry with its position expressed relative to the
targetCoordinateSystem, placed into the frame of the sourceCoordinateSystem.
The local position of the result within the sourceCoordinateSystem
matches the local position of the input within the targetCoordinateSystem.
To obtain the coordinates of a geometry in world-space within a given coordinate
system, pass CoordinateSystem.Identity as the sourceCoordinateSystem
and the given CS as the targetCoordinateSystem.
The resulting geometry coordinates will equal the coordinates of the input
relative to that target frame.
targetCoordinateSystem:
The CoordinateSystem to express the geometry relative to.
sourceCoordinateSystem:
The CoordinateSystem the geometry is currently expressed in.
Pass CoordinateSystem.Identity() to work in world space.
Returns: Transformed Geometry.
from,to, local coordinates

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double)
Rotates an object around an origin and an axis by a specified
degree
around,axis,degrees

Autodesk.DesignScript.Geometry.Geometry.Rotate(Autodesk.DesignScript.Geometry.Plane,System.Double)
Rotates an object around the Plane origin and normal by a specified
degree
basePlane: Reference Plane to rotate around
degrees: Rotation angle in degrees
around,normal,degrees

Autodesk.DesignScript.Geometry.Geometry.Mirror(Autodesk.DesignScript.Geometry.Plane)
Mirror the object across the input Plane
reflect,flip over

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double)
Scale uniformly around the origin
resize,size

Autodesk.DesignScript.Geometry.Geometry.Scale(System.Double,System.Double,System.Double)
Scale non-uniformly around the origin
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Plane,System.Double,System.Double,System.Double)
Scale non-uniformly around a given Plane
resize,size,scaleNU,scalenu

Autodesk.DesignScript.Geometry.Geometry.Scale(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale uniformly around a given point,  using two pick points as scalars
resize,from,to,size

Autodesk.DesignScript.Geometry.Geometry.Scale1D(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale non-uniformly in one dimension by base and 2 pick points.  The scaling axis is defined by the line between base and from point.
resize,size,from,to,scale1d,1d

Autodesk.DesignScript.Geometry.Geometry.Scale2D(Autodesk.DesignScript.Geometry.Plane,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point)
Scale in two dimensions by base and 2 pick points  The two pick points are projected onto the base plane in order to determine the 2d scale factors
resize,size,from,to,scale2d,2d

Autodesk.DesignScript.Geometry.Geometry.Clone
Copy the given Geometry
Returns: A new copy

Autodesk.DesignScript.Geometry.Geometry.DistanceTo(Autodesk.DesignScript.Geometry.Geometry)
Obtain the distance from this Geometry to another
entity: The other Geometry
Returns: The distance

Autodesk.DesignScript.Geometry.Geometry.ClosestPointTo(Autodesk.DesignScript.Geometry.Geometry)
Obtain the closest Point on this Geometry to the other
NearestPoint

Autodesk.DesignScript.Geometry.Geometry.Split(Autodesk.DesignScript.Geometry.Geometry)
Split this Geometry using another Geometry as a cutting "tool"

Autodesk.DesignScript.Geometry.Geometry.Trim(Autodesk.DesignScript.Geometry.Geometry,Autodesk.DesignScript.Geometry.Point)
Removes elements of the entity closest to the pick point

Autodesk.DesignScript.Geometry.Geometry.Explode
Separates compound or non-separated elements into their component
parts.

Autodesk.DesignScript.Geometry.Geometry.IsAlmostEqualTo(Autodesk.DesignScript.Geometry.Geometry)
Check if the two objects have the same representational geometry or numerical values

Autodesk.DesignScript.Geometry.Geometry.Approximate
Convert internal structure of geometry from analytics to splines
Returns:

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo)
Imports a SAT file and returns an array of imported geometries
file: File object representing the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String)
Imports a SAT file and returns an array of imported geometries
filePath: Path to the SAT file
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.IO.FileInfo,System.Double)
Imports a SAT file and returns an array of imported geometries.
file: File object representing the SAT file
mmPerUnit: the number of mm per unit which represents the "Dynamo" unitspace.
Used to scale the imported geometry from the unit space defined in the SAT file, to the one defined here.
If this is set to -1, we assume the SAT is unitless and import the geometry without unit scaling.
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.ImportFromSAT(System.String,System.Double)
Imports a SAT file and returns an array of imported geometries.
filePath: File object representing the SAT file
mmPerUnit: the number of mm per unit which represents the "Dynamo" unitspace.
Used to scale the imported geometry from the unit space defined in the SAT file, to the one defined here.
If this is set to -1, we assume the SAT is unitless and import the geometry without unit scaling.
Returns: List of imported geometries

Autodesk.DesignScript.Geometry.Geometry.FromSolidDef(System.String)
Imports a JSON string and returns an array of imported geometries
solidDefJson: Json string containg solid def formatted geometry
Returns: List of converted geometries

Autodesk.DesignScript.Geometry.Geometry.FromJson(System.String)
Parse the incoming JSON string formatted with autodesk.geometry:geometry-1.0.0 schemata.
json: JSON string to parse
Returns: Geometry Object

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String)
Exports a list of specified geometry to the given SAT file path
geometry:
filePath:
Returns:

Autodesk.DesignScript.Geometry.Geometry.ExportToSAT(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.String,System.Double)
Exports a list of specified geometry to the given SAT file path.
geometry:
filePath:
unitsMM:
Returns:

Autodesk.DesignScript.Geometry.Geometry.FromNativePointer(System.IntPtr)
This method is meant for internal use only.

Autodesk.DesignScript.Geometry.Geometry.ToNativePointer(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
This method is meant for internal use only.

Autodesk.DesignScript.Geometry.Geometry.SerializeAsSAB(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Serializes a list of specified geometry into Standard ACIS Binary(SAB) format and returns serialized binary stream data
geometry: Geometry to serialize
Returns: SAB formatted data as a list of bytes

Autodesk.DesignScript.Geometry.Geometry.DeserializeFromSAB(System.Byte[])
Deserializes the specified Standard ACIS Binary(SAB) format data and returns a list of geometry
buffer:
Returns:

Autodesk.DesignScript.Geometry.Geometry.DeserializeFromSAB(System.Byte[],System.Double)
Takes a SAB file as input, and deserializes the ASM geometry into
a LibG object
buffer:
mmPerUnit: millimeter per unit of the dynamo unit space, if -1 is passed, no unit conversion is done.
Returns:

Autodesk.DesignScript.Geometry.Geometry.ContextCoordinateSystem
The CoordinateSystem that this Geometry is defined in

Autodesk.DesignScript.Geometry.Geometry.DoesIntersect(Autodesk.DesignScript.Geometry.Geometry)
Determine if another Geometry object intersects with this one

Autodesk.DesignScript.Geometry.Geometry.Intersect(Autodesk.DesignScript.Geometry.Geometry)
Get the intersection Geometry for this object and another

Autodesk.DesignScript.Geometry.Geometry.IntersectAll(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry})
Get the intersection of Geometry for this object and a collection of other Geometries. Finds common geometry of all participants.

Autodesk.DesignScript.Geometry.Geometry.ToSolidDef
Convert to SolidDef json

Autodesk.DesignScript.Geometry.Geometry.ProjectPointsOnto(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector)
Projects a collection of Points onto this Geometry along the specified direction.
Returns a flat array of resulting Geometry.
points: Points to project.
projectionDirection: Projection direction.
Returns: Flat array of resulting Geometry.

Autodesk.DesignScript.Geometry.Geometry.ToString
Get a string representation of the Geometry