Autodesk.DesignScript.Geometry.NurbsSurface.DegreeU
Returns surface degree in the U direction.
surface smoothness,continuity

Autodesk.DesignScript.Geometry.NurbsSurface.DegreeV
Returns surface degree in the V direction.
surface smoothness,continuity

Autodesk.DesignScript.Geometry.NurbsSurface.NumControlPointsU
Returns number of control Points in the U direction.

Autodesk.DesignScript.Geometry.NurbsSurface.NumControlPointsV
Returns number of control Points in the V direction.

Autodesk.DesignScript.Geometry.NurbsSurface.IsPeriodicInU
Returns true if the Surface is periodic in the U direction.
closedinU

Autodesk.DesignScript.Geometry.NurbsSurface.IsPeriodicInV
Returns true if the Surface is periodic in the V direction.
closedinV

Autodesk.DesignScript.Geometry.NurbsSurface.IsRational
Determines whether the NurbsSurface is rational or not. This defines whether any of the weights are not 1.0. Returns True if surface is rational, false if its not.

Autodesk.DesignScript.Geometry.NurbsSurface.ControlPoints
Returns NurbsSurface control points (poles).

Autodesk.DesignScript.Geometry.NurbsSurface.Weights
Returns NurbsSurface control point weights. Weights will determine the influence applied by each of the control points on the shape of the surface.
Returns: Nurbs weights of surface
ptweights

Autodesk.DesignScript.Geometry.NurbsSurface.UKnots
Returns surface knots in U direction.  Knots is a series of parameter values (doubles)  used to determine where and how the control points affect the surface.
Returns: Nurbs U knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.VKnots
Returns surface knots in V direction.  Knots is a series of parameter values (doubles)  used to determine where and how the control points affect the surface.
Returns: Nurbs V knots of surface

Autodesk.DesignScript.Geometry.NurbsSurface.ByPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Creates a NurbsSurface with specified interpolated points and
U and V degrees.  The resultant surface will pass through all
of the points.
points: Grid of points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by points
fit,topoints

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangents(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Creates a NurbsSurface with specified interpolated points and
U and V degrees.  The resultant surface will pass through all
of the points.  The number of tangents must match the number of
points in the corresponding direction.  The resultant surface
will be degree 3 in both the U and V direction.
fit,topoints,totangents

Autodesk.DesignScript.Geometry.NurbsSurface.ByPointsTangentsKnotsDerivatives(Autodesk.DesignScript.Geometry.Point[][],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector},System.Double[],System.Double[],System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Vector})
Creates a NurbsSurface satisfying a collection of different surface characteristics.
This is the most advanced surface fitting method.  The resultant surface
will pass through all of the points.  The number of tangents must match
the number of points in the corresponding direction.  The resultant surface
will be degree 3 in both the U and V direction.  The corner derivatives should be
second order (dP/dUdV) and should be supplied in this order [ lowU, lowV ], [ highU, lowV ],
[ lowU, highV ], [ highU, highV ].
fit,topoints,totangents,fit corners,complex fit

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPoints(Autodesk.DesignScript.Geometry.Point[][],System.Int32,System.Int32)
Create a NurbsSurface by using explicit control Points, with specified U and V degrees.
controlVertices: Grid of control points for nurbs surface
uDegree: Degree in u direction
vDegree: Degree in v direction
Returns: Nurbs surface created by control points

Autodesk.DesignScript.Geometry.NurbsSurface.ByControlPointsWeightsKnots(Autodesk.DesignScript.Geometry.Point[][],System.Double[][],System.Double[],System.Double[],System.Int32,System.Int32)
Creates a NurbsSurface with specified control vertices, knots, weights,
and U V degrees.
There are several restrictions on the data which, if
broken, will cause the function to fail and will throw an exception.
Degree: Both u- and v- degree should be >= 1 (piecewise-linear spline)
and  less than 26 (the maximum B-spline basis degree supported by ASM).
Weights: All weight values (if supplied) should be strictly positive.
Weights smaller than 1e-11 will be rejected and the function will fail.
Knots: Both knot vectors should be non-decreasing sequences. Interior knot
multiplicity should be no larger than degree + 1 at the start/end knot and
degree at an internal knot (this allows surfaces with G1 discontinuities to
be represented). Note that non-clamped knot vectors are supported, but will
be converted to clamped ones, with the corresponding changes applied to the
control point/weight data.
lines
0.4

Autodesk.DesignScript.Geometry.NurbsSurface.ToString
Get a string representation of the NurbsSurface