ProtoGeometryGenerator.PropertyReplacementFieldAttribute
This attribute lets an interface property be auto generated from a backing field, letting that
field take the property's place in the ToString, Equals and HashCode methods.
Special handling is added for Point and Vector types when backed by a Coordinate.
This also lets the generator handle documentation for the property.

ProtoGeometryGenerator.PropertyReplacementFieldAttribute.#ctor(System.String,System.String)
This attribute lets an interface property be auto generated from a backing field, letting that
field take the property's place in the ToString, Equals and HashCode methods.
Special handling is added for Point and Vector types when backed by a Coordinate.
This also lets the generator handle documentation for the property.