Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSS(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface},System.String)
Exports a given set of T-spline surfaces to a T-spline scene file
tSplineSurfaces: Set of a T-Spline surfaces to export
filePath: Path to file to save to
Returns: File path where T-Spline set is being saved
tspline,export,save,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExportToTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface,System.String)
Exports a given T-spline surface to a T-spline mesh file
tSplineSurface: T-Spline surface to export
filePath: Path to file to save to
Returns: File path where T-Spline Surface is being saved
tspline,export,save,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SerializeAsTSM(Autodesk.DesignScript.Geometry.TSpline.TSplineSurface)
Translates the given T-spline surface into a string in T-spline mesh (TSM) format
tSplineSurface: T-Spline surface to serialize
Returns: String where T-Spline Surface is being serialized
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeserializeFromTSM(System.String,System.Boolean)
Creates a T-spline surface from a given string in T-spline mesh (TSM) format
content: String representation of T-Spline Mesh file
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Newly loaded T-Spline surface in list
tspline,import,serialize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.String,System.Boolean)
Loads a T-spline surface from the given T-spline mesh file path
filePath: Path to file to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Newly loaded T-Spline surface in list
tspline,import,load,tsm,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSM(System.IO.FileInfo,System.Boolean)
Loads a T-spline surface from the given T-spline mesh file
file: File to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Newly loaded T-Spline surface in list
tspline,import,load,tsm,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.String,System.Boolean)
Loads a set of a T-spline surfaces from the given T-spline scene file path
filePath: Path to file to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: A set of newly loaded T-Spline Surfaces
tspline,import,load,tss,path

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ImportFromTSS(System.IO.FileInfo,System.Boolean)
Loads a set of a T-spline surfaces from the given T-spline scene file
file: File to load from
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: A set of newly loaded T-Spline Surfaces
tspline,import,load,tss,file

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Reflections
A list of reflections applied to the t-spline
tspline,symmetry,reflections

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsInBoxMode
Whether t-spline is in box or smooth mode
tspline,boxmode,smooth

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsExtractable
Whether t-spline is extractable (Could be displayed in smooth mode)
tspline,extractable

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsClosed
Whether t-spline is closed
tspline,closed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsWaterTight
All closed surfaces are watertight, but some watertight surfaces are open.
tspline,watertight

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.IsStandard
Check all guarantees required for standardization to determine
if the t-spline is standard
tspline,standard

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToBRep(System.Boolean)
Convert TSpline surface to Solid or Surface depending on shape.
Note: There could be subtle unexpected changes in the resulting B-Rep if the input surface is created in a higher T-Splines version than the version loaded in Dynamo as in this case the surface will be downgraded to the Dynamo version.
matchTopology: Determines if the resulting body should have the same topology as the input TSpline surface.
Returns: Topology entity (Solid or Surface)
tspline,brep,solid,surface

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Thicken(System.Double,System.Boolean)
Thicken TSpline surface by given distance in the direction of its face normals
distance: Distance to thicken
softEdges: Determines if resulting edges should be creased
Returns: Thickened TSpline surface
tspline,thicken,normal

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Thicken(Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Thicken TSpline surface by given vector.
vector: Direction to thicken
softEdges: Determines if resulting edges should be creased
Returns: Thickened TSpline surface
tspline,thicken,vector

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreaseEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Perform crease on given set of edges
edges: Edges to crease
Returns: TSpline surface with creased edges
tspline,edge,crease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UncreaseEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Perform uncrease on given set of edges
edges: Edges to uncrease
Returns: TSpline surface with uncreased edges
tspline,crease,uncrease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreaseVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Perform crease on given set of vertices
vertices: Vertices to crease
Returns: TSpline surface with creased edges
tspline,edge,crease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UncreaseVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Perform uncrease on given set of vertices
vertices: Vertices to uncrease
Returns: TSpline surface with uncreased edges
tspline,crease,uncrease

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Boolean)
Weld vertices of first and second groups pairwise.
First group is considered as vertices of this t-spline.
Second group vertices can be either from this surface or from any other.
In case of different t-splines combine is performed before the weld operation
firstGroup: First group of vertices to weld
secondGroup: Second group of vecrtices to weld
keepSubdCreases: Preserve the subd-creases of the input topology
Returns: TSpline surface with welded vertices
tspline,weld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.WeldCoincidentVertices(System.Double)
Find all coincident vertices and weld them together.
tolerance: Tolerance to seek coincidence within
Returns: TSpline surface without coincident vertices
tspline,weld,coincident,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Unweld all the given edges, It will unweld each vertex on all the edges.
edges: A set of edges to unweld
Returns: TSpline surface with unwelded edges
tspline,unweld,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.UnweldVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Unweld all the specified vertices. All edges on every vertex will be unwelded.
vertices: A set of vertices to unweld
Returns: TSpline surface with unwelded vertices
tspline,unweld,vertex

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Create match with T-Spline and closed loop from curves
tsEdges: Closed T-Spline edge loop to create match with
curves: Closed curve loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
scale: Tangent scale for G1 or curvature scale for G2. Ignored if continuity is G0.
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and curve loop
tspline,match,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CreateMatch(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Edge},System.Int32,System.Boolean,System.Boolean,System.Int32,System.Double,System.Boolean,System.Double,System.Double,System.Boolean)
Create match with T-Spline and closed loop of BRep edges. First,
edge loop is converted to curve loop and then match is performed
tsEdges: Closed T-Spline edge loop to create match with
brepEdges: Closed BRep edge loop to create match with
continuity: Geometry continuity to attempt to match: G0, G1, G2
useArclength: Wether to use arcLength alignment while building match
useRefinement: If true, extra control points will be added to the T-spline to match the surfaces within a given tole­rance.
numRefinementSteps: Max number of refinement steps. Ignored if useRefinement is set to false
refinementTolerance: Tolerance to hit. Ignored if useRefinement is set to false
usePropagation: Whether to use propagation while building match
widthOfPropagation: Determines how much of the surface is affected by the match. Ignored if usePropagation is set to false
scale: Tangent scale for G1 or curvature scale for G2. Ignored if continuity is G0.
flipSourceTargetAlignment: Whether to reverse the alignment direction
Returns: T-Spline surface positioned between given T-Spline border edges and BRep edge loop
tspline,match,brep

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeleteVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Remove vertices from t-spline topology
vertices: Vertex or vertices to delete
Returns: TSpline surface with deleted vertices
tspline,vertex,vertices,delete

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeleteEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge})
Remove edges from t-spline topology
edges: Edge or edges to delete
Returns: TSpline surface with deleted edges
tspline,edge,delete

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DeleteFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Remove faces from t-spline topology
faces: Face or faces to delete
Returns: TSpline surface with deleted faces
tspline,face,delete

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.EnableSmoothMode(System.Boolean)
Change visualization style of t-spline.
Smooth visualization if true passed, box otherwise.
enable: Enable or disable smooth visualization
Returns: t-spline with chosen visualization style
tspline,visulization,mode,smooth,box

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},Autodesk.DesignScript.Geometry.Vector,System.Int32)
Perform a single or multiple symmetric extrudes on a set of edges and move new edges by given vector.
edges: A set of edges to extrude
direction: Vector to move new edges
spans: Amount of new segments that will be created
Returns: t-spline with extruded edges
tspline,extrude,direction,vector,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},Autodesk.DesignScript.Geometry.Vector,System.Int32)
Perform a single or multiple symmetric extrudes on a set of faces and move new edges by given vector.
faces: A set of faces to extrude
direction: Vector to move new faces
spans: Amount of new segments that will be created
Returns: t-spline with extruded faces
tspline,extrude,direction,vector,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeEdgesAlongCurve(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},Autodesk.DesignScript.Geometry.Curve,System.Int32)
Perform a single or multiple symmetric extrudes on a set of edges and move new edges by the path of given curve.
edges: A set of edges to extrude
curve: The path, new edges will follow
spans: Amount of new segments that will be created
Returns: t-spline with extruded edges
tspline,extrude,curve,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ExtrudeFacesAlongCurve(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},Autodesk.DesignScript.Geometry.Curve,System.Int32)
Perform a single or multiple symmetric extrudes on a set of faces and move new edges by the path of given curve.
faces: A set of faces to extrude
curve: The path, new faces will follow
spans: Amount of new segments that will be created
Returns: t-spline with extruded faces
tspline,extrude,curve,face

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BevelEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Double,System.Int32,System.Boolean,System.Double)
Replace given edges with a channel of faces.
edges: A set of edges to replace of
percentage: The bevel will be contained to this percentage (between 0 and 1) of the faces neighboring the selected edge.
segments: The number of rows of faces in the channel
keepOnFace: Whether to create new faces on the box mode faces of the old model.
roundness: Determines how round or flat the bevel is. Takes values from 0 to 1.
Returns: T-Spline with beveled edges
tspline,bevel,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SlideEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Double,System.Double)
Slide given edges along neighboring edges
edges: A set of edges to slide
amount: Edges will be slide this far (as a percentage between 0 and 1) toward the neighboring face.
roundness: Determines how round or flat the bevel is. Takes values from 0 to 1.
Returns: T-Spline with slided edges
tspline,slide,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MergeEdges(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Boolean)
Merge given edges. Edges in each groups should create equal counts
of continuous sets. Edges from the first group are considered as
edges of this surface. Edges from the second group can be either
from this surface or any other surface. In case of different
surfaces, combine is performed before merge
firstGroup: First set of edges to merge
secondGroup: Second set of edges to merge
insertCreases: The surface will match the original surfaces more closely.
Returns: T-Spline surface with merged edges
tspline,merge,edge

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FillHole(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineEdge},System.Int32,System.Boolean)
Fill holes in a T-spline
edges: Set of edges with hole inside. Edges must be border.
fillMethod: Method for filling hole: 0 - tesselation, 1 - ngons, 2 - collapse, 3 - collapse and weld
keepSubdCreases: Preserve the subd-creases of the input topology
Returns: TSpline surface with filled hole
tspline,edge,fill,hole

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.AddReflections(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineReflection},System.Boolean,System.Double)
Append given list of reflections to the t-spline
reflections: List of reflections
weldSymmetricPortions: Whether to weld symmetric portions
weldTolerance: Tolerance to weld symmetric portions
Returns: T-Spline surface with new reflections appended

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.RemoveReflections
Remove all reflections from the t-spline
Returns: T-Spline surface with given reflections removed

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.CompressIndexes
Compress all topology on the surface and make the indices contiguous.
This function maintains the relative order of the indices.
Returns: TSpline with compressed indexes
tspline,index,compress

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.SubdivideFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace},System.Boolean)
Subdivide given faces into four faces each in exact or simple mode
depending on given flag value.
faces: List of faces to subdivide
exact: If false, resulting surface can be flatter and sharper than the original,
if true, it keeps its original shape
Returns: T-Spline with given faces subdivided
tspline,subdivide,faces,simple

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Interpolate(System.Boolean)
Forward interpolation moves control points to their parametric locations
on the surface. Reverse interpolation generates a point on the surface
for each original control point and moves this control point to its
corresponding surface point.
reverse: Interpolation direction: forward if false, reverse otherwise
Returns: Interpolated T-Spline in given direction
tspline,interpolate,reverse

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.PullVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Geometry},System.Boolean)
Take every given t-spline vertex and pull it towards the closest point
on the target geometries. If surfacePoints is true then surface point
of the vertex is pulled, control grip otherwise
vertices: List of vertices to pull
geometries: List of geometries to pull to
surfacePoints: Flag, indicating whether to use surface or control points of vertices
Returns: T-Spline Surface with pulled vertices
tspline,pull,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex})
Flatten control points of given vertices to a single plane.
This command requires an input of at least four vertices
vertices: List of vertices
Returns: T-Spline Surface with flattened vertices
tspline,flatten,vertices

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlattenVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Plane)
Flatten control points of given vertices to a single plane
which will be parallel with the given plane.
This command requires an input of at least four vertices
vertices: List of vertices
parallelPlane: Plane to fit vertices parallel to
Returns: T-Spline Surface with flattened vertices
tspline,flatten,vertices,fitparallel

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.DuplicateFaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineFace})
Copy chosen faces to the new surface. New surface has no symmetry.
faces: Faces to duplicate
Returns: T-Spline Surface with chosen faces only
tspline,face,duplicate

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.FlipNormals
Inverts the normals of all faces in the mesh.
Returns: T-Spline Surface with inverted normals
tspline,flip,normal,vector

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MakeUniform
Set all knot intervals uniform.
Returns: T-Spline Surface with uniform internals
tspline,knot,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Standardize
Standardize the t-spline to the point where exact insertion
can be performed. If it cannot be standardized, exception is thrown
with the reason
Returns: Standardized T-Spline Surface
tspline,standardize

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.MoveVertices(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineVertex},Autodesk.DesignScript.Geometry.Vector,System.Boolean)
Move given vertices along given vector
vertices: Vertex list to be moved
vector: Vector to move along
onSurface: Flag, indicating whether to use surface or control points of vertices to move
Returns:

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.Repair
Attempts to repair the TsplineSurface.
Returns:

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormal(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Plane centered at root Point, with input normal Vector.
origin: Root point of plane
normal: Normal of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginNormalXAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create an "oriented" T-Spline Plane, positioned at Point origin with Vector
normal, but with a specific X axis orientation. This has no impact
on splitting, intersect, project, etc. operations, it only specifies
the orientation of the input CoordinateSystem.
origin: Root point of plane
normal: Normal of plane
xAxis: X-axis of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneOriginXAxisYAxis(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
The X and Y axis lie in the plane. The Z axis is the cross product of the two Vectors.
origin: Root point of plane
xAxis: X-axis of plane
yAxis: Y-axis of plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,origin,normal,axis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneBestFitThroughPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Fit a T-Spline Plane to the input Points; basically a 3D scatterplot fit.
points: A set of points to fit to plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,fit,bestfit,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneLineAndPoint(Autodesk.DesignScript.Geometry.Line,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create the T-Spline Plane containing the input Line and external Point. Point cannot lie on the Line or anywhere on the axis of the Line.
line: Line to build a plane
point: Point to build a plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,line,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByPlaneThreePoints(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Plane containing the three input Points. The Points cannot lie on a straight line
p1: First point to build a plane
p2: Second point to build a plane
p3: Third point to build a plane
minCorner: 2D point of minimum corner in coordinates of plane
maxCorner: 2D point of maximum corner in coordinates of plane
xSpans: Number of spans in width
ySpans: Number of spans in length
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Plane T-Spline Surface
tspline,plane,line,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderRadiusHeight(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Construct a T-Spline Cylinder defined by a parent CoordinateSystem, the radius, and the height of the cylinder
cs: Center and base of cylinder will be fit at X-Y plane of this coordinate system
radius: Radius of cylinder
height: Height of cylinder
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Cylindric T-Spline Surface
tspline,cylinder,radius,height

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCylinderPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Construct a T-Splines Cylinder given the bottom and top center point of the Cylinder.
startPoint: Start point of a cylinder
endPoint: End point of a cylinder
radius: Radius of a cylinder
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Cylindric T-Spline Surface
tspline,cylinder,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with given base radius at start Point, extending to an
apex at end Point.
startPoint: Start point of a cone
endPoint: End point of a cone
radius: Radius of base of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConePointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with axis from start Point to end Point, with given
radii at start and end. This object does not have an apex, and is in the shape of a frustum.
startPoint: Start point of a cone
endPoint: End point of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radii,points,truncated

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with base Point at CoordinateSystem origin, extending in the direction of the Z-axis of the CoordinateSystem,
with a  circular base in the CoordinateSystem XY Plane.
cs: Center and base of cone will be fit at X-Y plane of this coordinate system
height: Height of a cone
radius: Radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByConeCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Cone with base Point at CoordinateSystem origin, extending
in the CoordinateSystem Z axis deriction length amount, with a
circular bases in the CoordinateSystem XY Plane.
cs: Center and base of cone will be fit at X-Y plane of this coordinate system
height: Height of a cone
startRadius: Start radius of a cone
endRadius: End radius of a cone
radiusSpans: Number of spans in circumference
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Conical T-Spline Surface
tspline,cone,radius,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereCenterPointRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Sphere cetered at the input Point, with given radius.
centerPoint: Center of a sphere
radius: Radius of a sphere
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereFourPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Sphere containing four input Points on the surface.
points: Four points in list to build a sphere. Points should not be coplanar
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,points

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySphereBestFit(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Fit a T-Spline Sphere as close as possible to the input Points.
points: Set of points to fit a sphere
radiusSpans: Number of radial spans
heightSpans: Number of spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Spherical T-Spline Surface
tspline,sphere,fit,bestfit

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCoordinateSystemRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Torus with center at CoordinateSystem origin and given radii
cs: Torus will be aligned in the X-Y plane of given coordinate system with center in its origin
innerRadius: Inner radius of a torus
outerRadius: Outer radius of a torus
innerRadiusSpans: Number of inner radial spans
outerRadiusSpans: Number of outer radial spans
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Toroidal T-Spline Surface
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByTorusCenterRadii(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Torus with given center and radii, aligned with the default World XY plane
center: Center of a torus
innerRadius: Inner radius of a torus
outerRadius: Outer radius of a torus
innerRadiusSpans: Number of inner radial spans
outerRadiusSpans: Number of outer radial spans
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: Toroidal T-Spline Surface
tspline,torus,radii,cs

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Box centered at WCS origin, with width, length, and height.
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.Point,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Box centered at input Point, with specified width, length,
and height.
origin: Center of a box
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,center

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxLengths(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Box centered and oriented to input CoordinateSystem, with
specified width, length, and height.
cs: X-Y plane of box will be aligned with corresponding X
width: Width of a box
length: Length of a box
height: Height of a box
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline,box,cuboid,cube,size,cs,coord

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByBoxCorners(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Int32,System.Int32,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create an T-Spline Box spanning from low Point to high Point.
lowPoint: First corner point
highPoint: Second corner point
xSpans: Number spans in width
ySpans: Number spans in length
zSpans: Number spans in height
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Cuboid
tspline, box,cube,min,max,corner,point

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCoordinateSystemRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Quadball with center at CoordinateSystem origin
and given radius
cs: Local coordinate system
radius: Quadball radius
spans: Spans number in two dimensions of the sides of the Quadball
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tspline,coordinate system,raduis

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByQuadballCenterRadius(Autodesk.DesignScript.Geometry.Point,System.Double,System.Int32,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Splines Quadball with given center and radius, aligned with
default World XY plane
center: Quadball center point
radius: Quadball radius
spans: Spans number in two dimensions of the sides of the Quadball
symmetry: Symmetry options of a T-Spline Surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
Returns: T-Spline Quadball
quadball,tsplines,center,point,radius

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceUniform(Autodesk.DesignScript.Geometry.NurbsSurface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construct T-Spline surface from NURBS Surface using uniform strategy.
Input NURBS surface is rebuilt with uniform knots placed at equal parametric or
arc length intervals depending on corresponding useArcLen flag, and approximated by
degree 3 NURBS surface. Output T-Spline is divided by given span counts
in u and v directions.
nurbsSurface: Input NURBS surface
uSpans: Required spans number in u direction
vSpans: Required spans number in v direction
uUseArcLen: Whether to use arcLen or parametric subdivision in u parametric direction
vUseArcLen: Whether to use arcLen or parametric subdivision in v parametric direction
inSmoothMode: Show T-Spline Surface in box or smooth visualization
nurbs surface,tspline,uniform

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByNurbsSurfaceCurvature(Autodesk.DesignScript.Geometry.NurbsSurface,System.Boolean)
Construct T-Spline surface from NURBS Surface using curvature subdivision strategy.
Input NURBS surface is rebuilt to degree 3. Output T-Spline has span counts and
positions in each direction detected automatically depending on curvature.
nurbsSurface: Input NURBS surface
inSmoothMode: Show T-Spline Surface in box or smooth visualization
nurbs surface,tspline,curvature

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByExtrude(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Construct a T-Spline by extruding a curve along the given vector.
curve: Profile curve
direction: Extrude vector
frontDistance: Extrude distance in vector direction
backDistance: Extrude distance against vector direction
frontSpans: Spans number by vector direction. No extrusion in vector direction will be performed if 0 is passed
backSpans: Spans number against vector direction. No extrusion against vector direction will be performed if 0 is passed
profileSpans: Spans number in profile direction. Automatically defined if 0 or less
uniform: Use uniform or curvature strategy for spans distribution along profile direction
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,extrude,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BySweep(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Curve,System.Boolean,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Construct a T-Spline by sweeping a cross section Curve along a path.
profile: Profile curve
path: Path curve
parallel: Is spans should be parallel in path direction
pathSpans: Spans number in path
profileSpans: Spans number in profile. Automatically defined if 0 or less
pathUniform: Use uniform or curvature strategy for spans distribution along path
profileUniform: Use uniform or curvature strategy for spans distribution along profile
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,sweep,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByRevolve(Autodesk.DesignScript.Geometry.Curve,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector,System.Double,System.Double,System.Int32,System.Int32,System.Boolean,Autodesk.DesignScript.Geometry.TSpline.TSplineInitialSymmetry,System.Boolean)
Create a T-Spline Surface by sweeping the profile Curve around the axis formed
by the axis origin and axis direction, starting at start_angle in degrees,
and sweeping by sweep_angle in degrees.
profile: Profile curve
axisOrigin: Rotation center
axisDirection: Rotation axis
startAngle: Angle to start rotation from
sweepAngle: Angle to finish rotation at
radialSpans: Spans number in radius
axialSpans: Spans number in height. Automatically defined if 0 or less
uniform: Use uniform or curvature strategy for spans distribution
inSmoothMode: Show T-Spline Surface in box or smooth visualization
symmetry: Symmetry options of a T-Spline Surface
tspline,revolve,curve

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.BuildFromLines(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Int32,System.Double,System.Boolean,System.Boolean)
Create a T-Spline Surface from the list of lines.
Accepts curves, but takes only start and end points from them.
lines: Lines to build T-Spline from. Only endpoints are used
maxFaceValence: The maximum number of adjusted faces
snappingTolerance: The curve-curve intersection tolerance
creaseOuterVertices: Whether to crease vertices with valence 2 or not
inSmoothMode: Show T-Spline Surface in box or smooth visualization
tspline,line,build

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ByCombinedTSplineSurfaces(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.TSpline.TSplineSurface})
Combine given T-Spline Surfaces into a single one.
Surfaces can be disjoint.
If at least one surface is in box mode the output surface will be in box mode as well.
Note: All input surfaces must have the same version in order to be combined successfully. For this reason, one or more surfaces may be cloned internally and their versions either upgraded or downgraded to match the version currently used in Dynamo. The resulting surface may therefore have subtle differences from what might be the expected result. The input surfaces themselves will remain unchanged.
tSplineSurfaces: T-Spline Surfaces to combine
tspline,combine

Autodesk.DesignScript.Geometry.TSpline.TSplineSurface.ToString
Get a string representation of the TSplineSurface