Autodesk.DesignScript.Geometry.Cone.StartPoint
The start point
cone,cones

Autodesk.DesignScript.Geometry.Cone.EndPoint
The end point
cone,cones

Autodesk.DesignScript.Geometry.Cone.RadiusRatio
Ratio between the top and bottom radius
cone,cones

Autodesk.DesignScript.Geometry.Cone.StartRadius
The radius at the base
cone,cones

Autodesk.DesignScript.Geometry.Cone.EndRadius
The radius at the bottom
cone,cones

Autodesk.DesignScript.Geometry.Cone.Height
The total height
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadius(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double)
Create a Cone with given base radius at start Point, extending to a
apex at end Point.
cone,cones

Autodesk.DesignScript.Geometry.Cone.ByPointsRadii(Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Point,System.Double,System.Double)
Create a Cone with axis from start Point to end Point, with given
radiuses at start and end. This object does not have an apex, and
can be thought of as a trimmed Cone.
trimmed cone,cone,cones

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadius(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double)
Creates a Cone with base Point at CoordinateSystem origin, extending
in the CoordinateSystem Z axis deriction length amount, with a
circular base in the CoordinateSystem XY Plane.

Autodesk.DesignScript.Geometry.Cone.ByCoordinateSystemHeightRadii(Autodesk.DesignScript.Geometry.CoordinateSystem,System.Double,System.Double,System.Double)
Creates a Cone with base Point at CoordinateSystem origin, extending
in the CoordinateSystem Z axis deriction length amount, with a
circular bases in the CoordinateSystem XY Plane.
cone,cone by height,cones

Autodesk.DesignScript.Geometry.Cone.ToString
Get a string representation of the Cone