Autodesk.DesignScript.Geometry.NurbsCurve.Degree
The degree of the curve
smoothness,interpolation,continuity

Autodesk.DesignScript.Geometry.NurbsCurve.IsPeriodic
Whether the NurbsCurve is periodic or not, a periodic curve is a closed curve in which deformation does not cause the appearance of kinks.
isclosed

Autodesk.DesignScript.Geometry.NurbsCurve.IsRational
Determines whether the NurbsCurve is rational or not. This defines whether any of the weights are not 1.0.

Autodesk.DesignScript.Geometry.NurbsCurve.ControlPoints
Get the control points of the NurbsCurve.
Returns: An Array of Points

Autodesk.DesignScript.Geometry.NurbsCurve.PeriodicControlPoints
The truly periodic control points of a periodic NurbsCurve.
Note: This operation only works for periodic curves and will fail if the curve is not periodic.
Returns: Periodic control points of a NURBS curve

Autodesk.DesignScript.Geometry.NurbsCurve.Knots
The knots of the Curve. Knots is a series of parameter values (doubles) used to determine where and how the control points affect the curve.
Returns: The knots of the nurbs curve

Autodesk.DesignScript.Geometry.NurbsCurve.PeriodicKnots
The unclamped knots of a periodic NurbsCurve.
Note: This operation only works for periodic curves and will fail if the curve is not periodic.
Returns: The periodic knot vector of the NURBS curve

Autodesk.DesignScript.Geometry.NurbsCurve.Weights
Returns NurbsCurve control point weights. Weights determine the influence of each of the control points on the shape of the curve.
Returns: Weights of nurbs curve
ptweight

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a BSplineCurve by using explicit control points.
NOTE 1: BSplineCurves with deg=1 have G1 discontinuities, which cause problems
for extrusion, sweep, and other operations. They should be avoided. Use
a PolyCurve instead.
NOTE 2: If the curve is periodic (closed), then the first and last
points MUST be the same.
points: Points for nurbs curve
Returns: Nurbscurve created from points
nurbscurve,spline,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Create a BSplineCurve by using explicit control points.
NOTE 1: BSplineCurves with deg=1 have G1 discontinuities, which cause problems
for extrusion, sweep, and other operations. They should be avoided. Use
a PolyCurve instead.
NOTE 2: If the curve is periodic (closed), then the first and last
points MUST be the same.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32,System.Boolean)
Create a BSplineCurve by using explicit control points.
NOTE 1: BSplineCurves with deg=1 have G1 discontinuities, which cause problems
for extrusion, sweep, and other operations. They should be avoided. Use
a PolyCurve instead.
NOTE 2: If the curve is periodic (closed), then the first and last
points MUST be the same.
points: Points for nurbs curve
degree: Degree of the curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
nurbscurve,spline,degree,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByControlPointsWeightsKnots(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Double[],System.Double[],System.Int32)
Create a BSplineCurve by from control vertices, weights, and knots.
FROM ASM DOCS:
Degree: Should be greater than 1 (piecewise-linear spline) and less than 26 (the maximum
B-spline basis degree supported by ASM).
Weights: All weight values (if supplied) should be strictly positive.
Weights smaller than 1e-11 will be rejected and the function will fail.
Knots: The knot vector should be a non-decreasing sequence. Interior knot
multiplicity should be no larger than degree + 1 at the start/end knot and
degree at an internal knot (this allows curves with G1 discontinuities to be
represented). Note that non-clamped knot vectors are supported, but will be
converted to clamped ones, with the corresponding changes applied to the
control point/weight data.
knot array: the array size must be num_control_points + degree + 1
explicit,nurbscurve,spline,degree,spline byarray,lines
0.5,0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point})
Create a BSplineCurve by interpolating between points.
points: Points for nurbs curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Boolean)
Create a BSplineCurve by interpolating between points.
NOTE 2: If the curve is periodic (closed), then the first and last
points MUST be the same.
points: Points for nurbs curve
closeCurve: Toggle to close curve
Returns: Nurbscurve created from points
fit,approximate,spline,lines
0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPoints(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},System.Int32)
Create a BSplineCurve by interpolating between points with specified degree.
points: Points for nurbs curve
degree: Degree of the curve
Returns: Nurbscurve created from points
fit,approximate,spline,smoothness,lines
0.5,0.5,0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ByPointsTangents(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Point},Autodesk.DesignScript.Geometry.Vector,Autodesk.DesignScript.Geometry.Vector)
Returns a BSplineCurve through the points, with tangent directions.
points: Control points for nurbs curve
startTangent: Start tangent
endTangent: End tangent
Returns: Nurbscurve created from points and tangents
spline by tangent,tangents,lines
0.5,0.5,0.45

Autodesk.DesignScript.Geometry.NurbsCurve.ToString
Get a string representation of the NurbsCurve