Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Edges
All of the TSplineEdges around this Face in counterclockwise order
Returns:

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Vertices
All of the TSplineVertices around this Face in counterclockwise order
Returns:

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.UVNFrame
Return UVN Frame of the TSplineFace (point on the hull, U vector, V vector and normal)

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Index
Index of the TSFace

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Valence
Number of edges or vertices on the TSFace

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Sides
Number of parametric sides on the TSFace

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.Info
A bunch of TSplineFace properties: uvnFrame, index, valence and number of sides

Autodesk.DesignScript.Geometry.TSpline.TSplineFace.ToString
Get a string representation of the TSplineFace