Autodesk.DesignScript.Geometry.DesignScriptEntity.constructorThreadId
stores the managed thread id of thread which called this constructor.
Used to alert users to potential multi threaded issues.

Autodesk.DesignScript.Geometry.DesignScriptEntity.disposedWrongThread
This is used for testing only.